{
    "version": "https://jsonfeed.org/version/1",
    "title": "Uisneaċ • All posts by \"magic\" tag",
    "description": "From ancient times until the fall of the Gaelic Order, a sacred fire at Uisneaċ was lit on Beltaine each year to initiate the Mórdáil Uisneaċ, the Great Assembly. As such Uisneaċ became spiritually the Umbilicas Hibernicae, the Navel of Ireland. It was a ceremonial gathering place for kings, possibly where the High King would symbolically marry the goddess Ériu in the banais ríghe ritual, or Marriage of the King. A fire was kept there perpetually into the Christian Age, kept alight by woman-druids in a similar fashion to Rome’s sacred flame tended by Vestal Virgins.",
    "home_page_url": "https://uisneac.com",
    "items": [
        {
            "id": "https://uisneac.com/The-Song-of-Lugh/",
            "url": "https://uisneac.com/The-Song-of-Lugh/",
            "title": "The Song of Lugh",
            "date_published": "2025-10-27T00:55:39.000Z",
            "content_html": "<link rel=\"stylesheet\" class=\"aplayer-secondary-style-marker\" href=\"/assets/css/APlayer.min.css\"><script src=\"/assets/js/APlayer.min.js\" class=\"aplayer-secondary-script-marker\"></script><style>\narticle .content img.same-size { width: 150px; height: 150px; object-fit: fill; margin: 15px 0 0 0; }\narticle .content img.wide-image { width: 100%; height: auto; object-fit: fill; margin: 15px 0 0 0; }\narticle .content img.half-image { width: 50%; height: auto; object-fit: fill; margin: 15px 0 0 0; }\narticle .content img.free-image { width: auto; height: auto; max-width: 100%; max-height: none; margin: 15px 0 0 0; }\nimg { align-self: center; }\n</style>\n<p><img src=\"/The-Song-of-Lugh/TuathaDeDanann.jpg\" alt=\"\"></p>\n<p>On page 98 of <a href=\"https://archive.org/details/revueceltique12pari/page/n5/mode/2up\">Revue Celtique Vol. XII</a>, Whitley Stokes’ translation of the <em>Cath Maige Tuired</em> cuts off, leaving a speech given by Lugh to the <em>Tuatha Dé Danann</em> untranslated due to the difficulty of the language. As far as I can tell, there are three authors who have tried to tackle this passage, being <a href=\"https://storyarchaeology.com/about_us/\">Isolde Carmody</a> in <a href=\"https://storyarchaeology.com/lug-taunts-the-enemy/\">this post</a>, as well as Bernard Mees in his <a href=\"https://www.cambridge.org/core/books/celtic-curses/1C98E6A5F9E316AC729361BC9D245890\"><em>Celtic Curses</em></a>, and one by <a href=\"https://www.goodreads.com/book/show/55859901-cath-maige-tuired\">Morgan Daimler</a> (<em>they/them</em>), though Daimler calls herself ‘not a professional translator… a self-taught amateur’ in the book’s foreword. Carmody’s translation is, in my view, also amateurish, and Mees’ is only partial, leaving out a difficult portion in the middle; Daimler’s is somewhat better than Carmody’s but still falls into too many traps. So in the interest of the freedom of all knowledge, I will translate it myself, open to everyone.</p>\n<p>The manuscript, MS 5280 in the Harleian collection, was written in the 16th century by Giolla Riabhach Ó Cleirigh, a member of the famous Ó Cléirigh family of scribes and intellecutals (<em>Cléirigh</em> or <em>cléirech</em> is ultimately from Latin <em>clericus</em> or clerk). The <em>Cath</em> story from folio 63r-69v was transcribed by Stokes, but he neglected the “Song of Lugh” which I am interested in here. Rudolf Thurneysen, thankfully, finished the transcription in <a href=\"https://archive.org/details/zeitschriftfrc12meyeuoft/page/402/mode/2up\"><em>Zeitschrift fur Celtische Philologie</em> Vol. XII pg. 403</a>, along with the other portions of the Harleian 5280 which Stokes left untranslated, but did not offer a translation of his own. This transcription was apparently used by Elizabeth Gray in her 1982 translation of the <em>Cath</em>, though she too left this song untranslated. There are many words which are abbreviated by a ‘macron’ (see <a href=\"#Abbreviations\">below</a>) which leaves ambiguity at many parts of the text and which make translation of an already-ambiguous poetic text extremely difficult. But modern dictionaries and the online availability of pretty much all Old Irish texts as references give a modern translator an equal advantage.</p>\n<p>Lugh chants this chant before the assembled army of the <em>Tuatha Dé Danann</em> standing before the Fomorian troops, of which it is said “to attack the Fomorian host on that day was ‘striking a head against a cliff,’ was ‘a hand in a serpent’s nest,’ was ‘a face up to lire.’” He stands on one leg, with one arm, and one eye while circling the <em>Tuatha Dé</em>, demonstrating an instance of <em>corrguinecht</em>, the Old Irish magical stance often paired with <em>glám dícenn</em>, magical poetry.</p>\n<p>This endeavor must, then, begin from first principles with a transcription of the <a href=\"https://iiif.bl.uk/uv/#?manifest=https://bl.digirati.io/iiif/ark:/81055/vdc_100123802477.0x000001\">manuscript</a>, which I will give here.</p>\n<hr>\n<h2 id=\"The-Scribe’s-Hand\">The Scribe’s Hand</h2>\n<p>We must begin transcription by analyzing the scribe’s handwriting, including the common letters and abbreviations, ligatures, and lenitions. Note that the Old, Middle, and Modern Irish alphabets do not share all of the English alphabet’s letters, such as J, K, W, or X, which are absent.</p>\n<table>\n<thead>\n<tr>\n<th>English Letter</th>\n<th>Scribe’s Letter</th>\n<th></th>\n<th>English Letter</th>\n<th>Scribe’s Letter</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>A</td>\n<td><img src=\"A.png\" alt=\"\" class=\"same-size\" /></td>\n<td></td>\n<td>L</td>\n<td><img src=\"L.png\" alt=\"\" class=\"same-size\" /></td>\n</tr>\n<tr>\n<td>B</td>\n<td><img src=\"B.png\" alt=\"\" class=\"same-size\" /></td>\n<td></td>\n<td>M</td>\n<td><img src=\"M.png\" alt=\"\" class=\"same-size\" /></td>\n</tr>\n<tr>\n<td>C</td>\n<td><img src=\"C.png\" alt=\"\" class=\"same-size\" /></td>\n<td></td>\n<td>N</td>\n<td><img src=\"N.png\" alt=\"\" class=\"same-size\" /></td>\n</tr>\n<tr>\n<td>D</td>\n<td><img src=\"D.png\" alt=\"\" class=\"same-size\" /></td>\n<td></td>\n<td>O</td>\n<td><img src=\"O.png\" alt=\"\" class=\"same-size\" /></td>\n</tr>\n<tr>\n<td>E</td>\n<td><img src=\"E.png\" alt=\"\" class=\"same-size\" /></td>\n<td></td>\n<td>P</td>\n<td><img src=\"P.png\" alt=\"\" class=\"same-size\" /></td>\n</tr>\n<tr>\n<td>F</td>\n<td><img src=\"F.png\" alt=\"\" class=\"same-size\" /></td>\n<td></td>\n<td>R</td>\n<td><img src=\"R.png\" alt=\"\" class=\"same-size\" /></td>\n</tr>\n<tr>\n<td>G</td>\n<td><img src=\"G.png\" alt=\"\" class=\"same-size\" /></td>\n<td></td>\n<td>S</td>\n<td><img src=\"S.png\" alt=\"\" class=\"same-size\" /></td>\n</tr>\n<tr>\n<td>H</td>\n<td><img src=\"H.png\" alt=\"\" class=\"same-size\" /></td>\n<td></td>\n<td>T</td>\n<td><img src=\"T.png\" alt=\"\" class=\"same-size\" /></td>\n</tr>\n<tr>\n<td>I</td>\n<td><img src=\"I.png\" alt=\"\" class=\"same-size\" /></td>\n<td></td>\n<td>U</td>\n<td><img src=\"U.png\" alt=\"\" class=\"same-size\" /></td>\n</tr>\n</tbody>\n</table>\n<h3 id=\"Ligatures\">Ligatures</h3>\n<p>Most letters follow a consistent script, a form of insular script, but a close reader may notice some aberrant symbols. The scribe, to save space, will often combine two letters into one glyph in a process called “ligature”. A table of some of these occurrences is presented:</p>\n<table>\n<thead>\n<tr>\n<th>English Letters</th>\n<th>Scribe’s Glyph</th>\n<th>English Letters</th>\n<th>Scribe’s Glyph</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>A+R</td>\n<td><img src=\"AR.png\" alt=\"\" class=\"same-size\" /></td>\n<td>E+T</td>\n<td><img src=\"ET2.png\" alt=\"\" class=\"same-size\" /></td>\n</tr>\n<tr>\n<td>B+R</td>\n<td><img src=\"BR.png\" alt=\"\" class=\"same-size\" /></td>\n<td>I+R</td>\n<td><img src=\"IR.png\" alt=\"\" class=\"same-size\" /></td>\n</tr>\n<tr>\n<td>D+E</td>\n<td><img src=\"DE.png\" alt=\"\" class=\"same-size\" /></td>\n<td>O+R</td>\n<td><img src=\"OR.png\" alt=\"\" class=\"same-size\" /></td>\n</tr>\n<tr>\n<td>D+O</td>\n<td><img src=\"DO.png\" alt=\"\" class=\"same-size\" /></td>\n<td>S+I</td>\n<td><img src=\"SI.png\" alt=\"\" class=\"same-size\" /></td>\n</tr>\n<tr>\n<td>E+C</td>\n<td><img src=\"EC.png\" alt=\"\" class=\"same-size\" /></td>\n<td>D+E</td>\n<td><img src=\"DE.png\" alt=\"\" class=\"same-size\" /></td>\n</tr>\n<tr>\n<td>E+I</td>\n<td><img src=\"EI.png\" alt=\"\" class=\"same-size\" /></td>\n<td>D+E+A</td>\n<td><img src=\"DEA.png\" alt=\"\" class=\"same-size\" /></td>\n</tr>\n<tr>\n<td>E+N</td>\n<td><img src=\"EN.png\" alt=\"\" class=\"same-size\" /></td>\n<td>D+E+G</td>\n<td><img src=\"DEG.png\" alt=\"\" class=\"same-size\" /></td>\n</tr>\n<tr>\n<td>E+R</td>\n<td><img src=\"ER.png\" alt=\"\" class=\"same-size\" /></td>\n<td>D+E+N</td>\n<td><img src=\"DEN.png\" alt=\"\" class=\"same-size\" /></td>\n</tr>\n</tbody>\n</table>\n<p>See how in D ligatures, the D glyph, which usually has a nearly-horizontal leftward stroke on top, is rotated so that it’s top stroke points upwards, making it appear more similar to an A. Also note how in R ligatures, the downstroke that forms the spine of the R glyph can be completely omitted, and only the arm of the glyph left remaining.</p>\n<p>It should be said that such a stroke only represents an R if the lower portion moves to the right as it does in a regular R character: moving to the left means something utterly different. See this abbreviation which uses a similar falling arm, but which has a bottom stroke curving leftward, looking similar to a modern semicolon (;) or a <a href=\"https://guides.loc.gov/manuscript-facsimiles/deciphering-scribal-abbreviations#s-lib-ctab-24229924-3\">yogh</a> symbol (ȝ) of Old English. This word ultimately is “AMNUS”, meaning “cruel”, with the final arm representing the “-US”.</p>\n<img src=\"AMNUS.png\" alt=\"\" class=\"half-image\" style=\"margin-bottom: 20px;\" />\n<table>\n<thead>\n<tr>\n<th>R</th>\n<th>R-Ligature</th>\n<th>-US</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><img src=\"R_FLOURISH.png\" alt=\"\" class=\"free-image\" /></td>\n<td><img src=\"R_LIGATURE.png\" alt=\"\" class=\"free-image\" /></td>\n<td><img src=\"US.png\" alt=\"\" class=\"free-image\" /></td>\n</tr>\n</tbody>\n</table>\n<p>The use of ligature rests wholly on the scribe’s preference at the time of writing. For example, we can see him write the letters E+T either as ligature or separately at different locations on the folio:</p>\n<table>\n<thead>\n<tr>\n<th>ET Ligature</th>\n<th>ET Standalone</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><img src=\"ET2.png\" alt=\"\" class=\"same-size\" /></td>\n<td><img src=\"ET.png\" alt=\"\" class=\"same-size\" /></td>\n</tr>\n</tbody>\n</table>\n<div class=\"spacer\"></div>\n<h3 id=\"Abbreviations\">Abbreviations</h3>\n<p>Many words are shortened by means of abbreviation, and most of those by a <em>macron</em> or bar above the letter. The reader is meant to understand that the word ending which has been abbreviated is so common, or so easily derived from context, that writing out the full word is not necessary. We can see at the top of the folio that the scribe abbreviates “<em>Tuatha Dé Danann</em>” as “.t.d.d.”; it is understood that the reader, if he has been reading along, will naturally assume TDD stands for <em>Tuatha Dé Danann</em> from context.</p>\n<img src=\"TDD.png\" alt=\"\" class=\"wide-image\" />\n<p>Most abbreviations, though, use a <em>macron</em>. In this phrase below, we have only the letters “FER NER̄” to read from, but one who has been reading the entire story will recall that the conflict is between the <em>fer fomoire</em> (men of the Fomorians) and the <em>fer nErenn</em> (men of Ireland), so it is not necessary to finish writing the word <em>nErenn</em>, one can simply assume.</p>\n<img src=\"FER NERENN.png\" alt=\"\" class=\"half-image\" />\n<p>In fact, we also see the scribe abbreviate the phrase “<em>fine fomoire</em>” on both words, leaving us with only “FĪE FOMR̄” to read (note: a <em>fine</em> is an Old Irish patrilineal kin-group).</p>\n<img src=\"FINE FOMOIRE.png\" alt=\"\" class=\"half-image\" />\n<p>Often common Irish words will be shortened due to the commonality or their use. See here the word “D’FHOGAIL”, meaning “for plundering / for defense”; we are meant to infer its common suffix “<em>-ail</em>” based on grammar context:</p>\n<img src=\"DFHOGAIL.png\" alt=\"\" class=\"half-image\" />\n<p>A word can be expressed entirely through ligature and abbreviation, such as this one which Stokes rendered as “DIDIU”.</p>\n<img src=\"DIDIU.png\" alt=\"\" class=\"same-size\" />\n<p>One must be an Old Irish scholar to correctly fill in these gaps with the appropriate words, which is why I resolve my uncertainties through Stokes’ methods used in previous sections of this text.</p>\n<h3 id=\"Reading-Letters\">Reading Letters</h3>\n<p>A reader should also note that in this script, a letter may consist on many strokes, but the initial stroke of a letter is designated by a wedge or triangular stroke (a serif): if a downward stroke does not have this serif, it is not a new letter. See how we can differentiate between the M and N in this word “FOMNAI”:</p>\n<img src=\"FOMNAI.png\" alt=\"\" class=\"free-image\" />\n<p>Despite there being five near-identical downward strokes in the middle of this word, the upper serifs differentiate letter-initial strokes from strokes that continue a letter.</p>\n<img src=\"FOMNAI_CIRCLED.png\" alt=\"\" class=\"free-image\" />\n<p>The one exception is the letter U, in which both downstrokes contain a serif. See here the word “LUG”, in which the L and U collectively have three wedges:</p>\n<img src=\"LUG.png\" alt=\"\" class=\"half-image\" />\n<p>But sometimes the scribe writes too quickly and his U’s slide across the folio appearing like a different glyph. Here is the word “TUATH” with a speedily-written U and a lenited T marked with a dot.</p>\n<img src=\"TUATH.png\" alt=\"\" class=\"half-image\" />\n<p>We can also see an occasional capital letter, sometimes applied randomly to a letter in a word. There are larger capitals on the margins of the folio, and smaller capital letters inline with a sentence. These are typically easy to identify with their lower-case counterparts.</p>\n<table>\n<thead>\n<tr>\n<th>Capital</th>\n<th>Note</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><img src=\"A_CAP.png\" alt=\"\" class=\"same-size\" /></td>\n<td>Capital A - Marginal</td>\n</tr>\n<tr>\n<td><img src=\"A_CAP_INLINE.png\" alt=\"\" class=\"same-size\" /></td>\n<td>Capital A - Inline</td>\n</tr>\n<tr>\n<td><img src=\"R_CAP.png\" alt=\"\" class=\"same-size\" /></td>\n<td>Capital R - Marginal</td>\n</tr>\n<tr>\n<td><img src=\"D_CAP_INLINE.png\" alt=\"\" class=\"same-size\" /></td>\n<td>Capital D - Inline</td>\n</tr>\n</tbody>\n</table>\n<p>In the word below, the scribe writes an initial capital I, but then also a capital N after it, which could confuse a casual reader. Together this makes the common Old Irish word “intan” meaning “then / while”.</p>\n<img src=\"INtan.png\" alt=\"\" class=\"half-image\" />\n<p>There are also entirely unique symbols used to denote common syllables. The three glyphs below are rendered by Stokes as “CONSE…”.</p>\n<img src=\"UNKNOWN.png\" alt=\"\" class=\"half-image\" />\n<p>The entire “Song of Lugh” is preceded by this strange double stroke symbol which, as far as I can tell, corresponds to no letter.</p>\n<img src=\"SYMBOL.png\" alt=\"\" class=\"same-size\" />\n<p>Thurneysen uses this symbol to demarcate a kind of ‘overflow line’ for words that should appear elsewhere in the text. In his transcription he moves the words which come after this strange symbol (but are still on the same line) to after the line that begins “Arotroi cath comartan…”. Presumably the scribe wanted the ‘A’ in “Arotroi” to be larger and to sit on the margin, but didn’t want to waste precious vellum with empty space, so he finished out the previous line with text that was meant to go after the “Arotroi…” line. Therefore, Thurneysen moved the “silsit- …” line to after the “Arotroi…” line.</p>\n<p>Here is an example of Stokes doing the same thing for this symbol on folio 67v. He moves the “ol Corpri…” line to after the “Os tusai…” line. The scribe then, again, wanted the first letter of this new paragraph to be larger in the margin. So in my transcription, the “silsit- …” line will also follow after the “Arotroi…” line.</p>\n<img src=\"SYMBOL_IN_USE.png\" alt=\"\" class=\"wide-image\" />\n<img src=\"STOKES_TRANSCRIPTION.png\" alt=\"\" class=\"wide-image\" />\n<hr>\n<h2 id=\"Transcription\">Transcription</h2>\n<p>The untranslated poem appears on the page as follows:</p>\n<img src=\"POEM.png\" alt=\"\" class=\"wide-image\" />\n<p>I will go line by line and merely relocate the letters from insular into Roman script. Note that a dash ‘-’ indicates a macron over the preceding letter, a double parenthesis ‘()’ indicates a curved stroke above the previous letter, and a plus ‘+’ indicates a downstroke with a crossbar.</p>\n<img src=\"LINE2.png\" alt=\"\" class=\"wide-image\" />\n<i>Arotroi cat comartan isin cath irgal robris comlondo f-slecht- slu-</i>\n<img src=\"LINE1.png\" alt=\"\" class=\"wide-image\" />\n<i>silsit- riaslu- sioabrai iath fer fomnai cuife</i>\n<img src=\"LINE3.png\" alt=\"\" class=\"wide-image\" />\n<i>cithai fir genrogain lentor gala fordomaisit fordomcloisid f-an</i>\n<img src=\"LINE4.png\" alt=\"\" class=\"wide-image\" />\n<i>dechraiged fir duib becc find nomtain- fó fó fé fé cléamainsi no</i>\n<img src=\"LINE5.png\" alt=\"\" class=\"wide-image\" />\n<i>efit- maim- iernelscoth- trietrenc-daib druag Nimcredbod catha f()c()cha</i>\n<img src=\"LINE6.png\" alt=\"\" class=\"wide-image\" />\n<i>nesit- mede midege fornemairces f-luachoir loisces ma+tal- tshuides</i>\n<img src=\"LINE7.png\" alt=\"\" class=\"wide-image\" />\n<i>ma+torain- trogais ni comairsid f()cechnaie go comair ogma sachu go</i>\n<img src=\"LINE8.png\" alt=\"\" class=\"wide-image\" />\n<i>comair ne- agus talom go comair g()oa- agus esa+u. Drem madh mo dremsie duib</i>\n<img src=\"LINE9.png\" alt=\"\" class=\"wide-image\" />\n<i>Moslu-so slu- mor murnech mochtsailech bruithe nt-oirech rogeno+</i>\n<img src=\"LINE10.png\" alt=\"\" class=\"wide-image\" />\n<p><i>et- dacri ataf-roi cath comortai. Arot''i</i> (Stokes' translation resumes here)</p>\n<h3 id=\"Thurneysen’s-Transcription\">Thurneysen’s Transcription</h3>\n<p>Well before my undertaking of this work, Rudolf Thurneysen completed a transcription of this passage in <a href=\"https://archive.org/details/zeitschriftfrc12meyeuoft/page/402/mode/2up\"><em>Zeitschrift fur Celtische Philologie</em> Vol. XII pg. 403</a>, which I will provide now for comparison with my own. Note that a dash once again indicates a <em>macron</em> above the preceding letter, and text in italics has been filled in by Thurneysen in the place of <em>macrons</em> which are sufficiently obvious.</p>\n<blockquote>\n<p>Atroroi cat comartan isincathirgal robris comlondo f<em>or</em>slecht- slu- silsit- riaslu- sioa- brai iath fer fomnai . cuifecithai fir genrogain lentor gala. fordomaisit fordomcloisid f<em>or</em>andechraiged fir duib becc find nomtam . fó fó fé fé clé amainsi noefit- mann iernelscoth- trietrenc<em>er</em>daib druag. Nimcredbod catha fricricha nesit- mede midege fornemairces f<em>or</em>luachoir loisces martal- tṡuides martorai<em>n</em>n trogais . incomairsid fricechnaie gocomair ogma sachu gocomair nem 7 talom gocomair grioan 7 esqu Drem níadh modremsie duib Moslu-so slu- mor murnech mochtsailech bruithe n<em>er</em>toirech rogenoir et- dacri ataf<em>or</em>roi cath comortai. arot<em>ra</em>i.</p>\n</blockquote>\n<p>You may notice, like I did, two errors in this transcription, either due to Thurneysen or, more likely, his printer. The first word <em>Arotroi</em> on the manuscript is here rendered “Atroroi”, meaning <a href=\"https://dil.ie/4923\">“to fail”</a>; and the word <em>nicomairsid</em> is rendered as <em>incomairsid</em>. The former error I attribute to the printer, because the <em>arotrai</em> which ends the poem is printed correctly; the latter I attribute to Thurneysen, since the three downstrokes which make up both <em>in-</em> and <em>ni-</em> can be easily confused, and I am only more confident in my own interpretation because of high-quality digital imagery that isn’t obscured by light and shadow or by tired eyes.</p>\n<hr>\n<h2 id=\"Word-Analysis\">Word Analysis</h2>\n<p>The words are divided here based on how they appear to me to be separated on the folio.</p>\n<table>\n<thead>\n<tr>\n<th>Ref.</th>\n<th>Written</th>\n<th>Old Irish</th>\n<th>P.o.S.</th>\n<th>English</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td></td>\n<td>Line 1.</td>\n<td></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>1</td>\n<td>Arotroi</td>\n<td><a href=\"https://dil.ie/4913\">at-reig</a></td>\n<td></td>\n<td>Arise!</td>\n</tr>\n<tr>\n<td>2</td>\n<td>cat</td>\n<td>cath</td>\n<td></td>\n<td>battle</td>\n</tr>\n<tr>\n<td>3</td>\n<td>comartan</td>\n<td><a href=\"https://dil.ie/10761\">comart</a></td>\n<td></td>\n<td>mutual-striking</td>\n</tr>\n<tr>\n<td>4</td>\n<td>isin</td>\n<td><a href=\"https://en.wikipedia.org/wiki/Old_Irish_grammar\">isin</a></td>\n<td></td>\n<td>in, at or into</td>\n</tr>\n<tr>\n<td>5</td>\n<td>cath</td>\n<td>cath</td>\n<td></td>\n<td>battle</td>\n</tr>\n<tr>\n<td>6</td>\n<td>irgal</td>\n<td><a href=\"https://dil.ie/search?q=irgal\">airgal</a></td>\n<td>gen. pl.?</td>\n<td>boiling / upheaval / battle / strife</td>\n</tr>\n<tr>\n<td>7</td>\n<td>robris</td>\n<td>ro + <a href=\"https://dil.ie/6848\">brisid</a></td>\n<td>past.</td>\n<td>perfective-marker + break or overthrow, defeat</td>\n</tr>\n<tr>\n<td>8</td>\n<td>comlondo</td>\n<td><a href=\"https://dil.ie/11408\">comlann</a> or <a href=\"https://dil.ie/10554\">com</a> + <a href=\"https://dil.ie/30660\">lond</a></td>\n<td>nom. s.?</td>\n<td>contest, battle, fight or equally-fierce</td>\n</tr>\n<tr>\n<td>9</td>\n<td>f-slecht- (forslecht(aib?))</td>\n<td><a href=\"https://dil.ie/23272\">for</a> + <a href=\"https://dil.ie/37871\">slecht</a> or <a href=\"https://dil.ie/37939\">sligid</a></td>\n<td>dat. or 3rd. pass. s.</td>\n<td>upon, for + hewing, cutting, slaughtering? or lay low, slay, defeat</td>\n</tr>\n<tr>\n<td>10</td>\n<td>slu- (slúaig)</td>\n<td><a href=\"https://dil.ie/37981\">slúag</a></td>\n<td>gen.</td>\n<td>host, army</td>\n</tr>\n<tr>\n<td></td>\n<td>Line 2.</td>\n<td></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>11</td>\n<td>silsit- (silsiter)</td>\n<td><a href=\"https://dil.ie/37939\">sligid</a></td>\n<td>3rd. pl. pass. fut.</td>\n<td>will lay low, will slay, will defeat</td>\n</tr>\n<tr>\n<td>12</td>\n<td>riaslu- (riasluag)</td>\n<td><a href=\"https://dil.ie/34869\">ria</a> + <a href=\"https://dil.ie/37981\">slúag</a></td>\n<td>dat.</td>\n<td>before + host, army</td>\n</tr>\n<tr>\n<td>13</td>\n<td>sioabrai</td>\n<td><a href=\"https://dil.ie/37365\">síabraid</a> or <a href=\"https://dil.ie/37359\">síabair</a></td>\n<td>adj. or part.</td>\n<td>bewitched, aroused to fury, or relating to phantoms</td>\n</tr>\n<tr>\n<td>14</td>\n<td>iath</td>\n<td><a href=\"https://dil.ie/27115\">íath</a></td>\n<td>gen. pl.</td>\n<td>of the lands / territories</td>\n</tr>\n<tr>\n<td>15</td>\n<td>fer</td>\n<td><a href=\"https://dil.ie/21665\">fer</a></td>\n<td>gen. pl.</td>\n<td>of the men</td>\n</tr>\n<tr>\n<td>16</td>\n<td>fomnai</td>\n<td><a href=\"https://dil.ie/23219\">fo-moinethar</a></td>\n<td></td>\n<td>wary, vigilant</td>\n</tr>\n<tr>\n<td>17</td>\n<td>cuife</td>\n<td><a href=\"https://dil.ie/13490\">cuife</a></td>\n<td></td>\n<td>cave, den (of animals)</td>\n</tr>\n<tr>\n<td></td>\n<td>Line 3.</td>\n<td></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>18</td>\n<td>cithai</td>\n<td><a href=\"https://dil.ie/9254\">cit</a></td>\n<td>gen. pl.</td>\n<td>sheep</td>\n</tr>\n<tr>\n<td>19</td>\n<td>fir</td>\n<td><a href=\"https://dil.ie/21665\">fer</a></td>\n<td>gen. pl.</td>\n<td>men</td>\n</tr>\n<tr>\n<td>20</td>\n<td>genrogain</td>\n<td><a href=\"https://dil.ie/8581\">cen</a> + <a href=\"https://dil.ie/35441\">rogain</a></td>\n<td></td>\n<td>without + choice</td>\n</tr>\n<tr>\n<td>21</td>\n<td>lentor</td>\n<td><a href=\"https://dil.ie/29895\">lenaid</a> (lend + ar or lentar)</td>\n<td>3rd. s. or 3rd. pass.</td>\n<td>stay attach to, cling to</td>\n</tr>\n<tr>\n<td>22</td>\n<td>gala</td>\n<td><a href=\"https://dil.ie/25277\">gal</a></td>\n<td>gen. s.</td>\n<td>heat, mist or war fury, valor</td>\n</tr>\n<tr>\n<td>23</td>\n<td>for</td>\n<td><a href=\"https://dil.ie/23272\">for</a></td>\n<td></td>\n<td>upon</td>\n</tr>\n<tr>\n<td>24</td>\n<td>domaisit</td>\n<td><a href=\"https://dil.ie/18065\">do-maisi</a></td>\n<td></td>\n<td>elaborates, devises, invents, concocts</td>\n</tr>\n<tr>\n<td>25</td>\n<td>for</td>\n<td><a href=\"https://dil.ie/23272\">for</a></td>\n<td></td>\n<td>upon, on</td>\n</tr>\n<tr>\n<td>26</td>\n<td>domcloisid</td>\n<td>dom + <a href=\"https://dil.ie/9588\">cloisid</a></td>\n<td></td>\n<td>to me + listen</td>\n</tr>\n<tr>\n<td>27</td>\n<td>f-an (foran)</td>\n<td>fora + n-</td>\n<td></td>\n<td>upon, on + (relative marker)</td>\n</tr>\n<tr>\n<td></td>\n<td>Line 4.</td>\n<td></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>28</td>\n<td>dechraiged</td>\n<td><a href=\"https://dil.ie/14925\">dechraigidir</a></td>\n<td>3rd s. pret. subj.</td>\n<td>mark out, distinguish (intrans.) / scatter, stand apart, differ (trans.)</td>\n</tr>\n<tr>\n<td>29</td>\n<td>fir</td>\n<td><a href=\"https://dil.ie/21665\">fer</a></td>\n<td>nom. pl. or gen. s.</td>\n<td>men or of a man</td>\n</tr>\n<tr>\n<td>30</td>\n<td>duib</td>\n<td><a href=\"https://dil.ie/18985\">dub</a></td>\n<td>adj.</td>\n<td>black, dark</td>\n</tr>\n<tr>\n<td>31</td>\n<td>becc</td>\n<td><a href=\"https://dil.ie/5512\">becc</a></td>\n<td>adj.</td>\n<td>small, little / few</td>\n</tr>\n<tr>\n<td>32</td>\n<td>find</td>\n<td><a href=\"https://dil.ie/22134\">finn</a></td>\n<td>adj.</td>\n<td>bright, white</td>\n</tr>\n<tr>\n<td>33</td>\n<td>nomtain- (nomtainn)</td>\n<td><a href=\"https://dil.ie/33244\">noem</a> + <a href=\"https://dil.ie/39627\">táin</a></td>\n<td></td>\n<td>holy, sacred + raid, driving-off</td>\n</tr>\n<tr>\n<td>34</td>\n<td>fó</td>\n<td><a href=\"https://dil.ie/22335\">fo</a></td>\n<td></td>\n<td>Joy!</td>\n</tr>\n<tr>\n<td>35</td>\n<td>fó</td>\n<td><a href=\"https://dil.ie/22335\">fo</a></td>\n<td></td>\n<td>Joy!</td>\n</tr>\n<tr>\n<td>36</td>\n<td>fé</td>\n<td><a href=\"https://dil.ie/21372\">fé</a></td>\n<td></td>\n<td>woe!</td>\n</tr>\n<tr>\n<td>37</td>\n<td>fé</td>\n<td><a href=\"https://dil.ie/21372\">fé</a></td>\n<td></td>\n<td>woe!</td>\n</tr>\n<tr>\n<td>38</td>\n<td>cleamainsi</td>\n<td><a href=\"https://dil.ie/9397\">clé</a> + <a href=\"https://dil.ie/3125\">amein</a> + si</td>\n<td></td>\n<td>evil! + thusly / so! + emph.</td>\n</tr>\n<tr>\n<td>39</td>\n<td>no</td>\n<td></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td></td>\n<td>Line 5.</td>\n<td></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>40</td>\n<td>efit-</td>\n<td><a href=\"https://dil.ie/33244\">noíb</a> + <a href=\"https://dil.ie/34382\">pít</a></td>\n<td></td>\n<td>holy, sacred + food, ration</td>\n</tr>\n<tr>\n<td>41</td>\n<td>maim- (máime?)</td>\n<td><a href=\"https://dil.ie/31501\">mám</a></td>\n<td></td>\n<td>fistful</td>\n</tr>\n<tr>\n<td>42</td>\n<td>iernelscoth-</td>\n<td><a href=\"https://dil.ie/27226\">ier</a> + <a href=\"https://dil.ie/33060\">nel</a> + <a href=\"https://dil.ie/36595\">scothach</a></td>\n<td></td>\n<td>across, beyond + cloud + fluffy, tufted</td>\n</tr>\n<tr>\n<td>43</td>\n<td>trietrenc-daib</td>\n<td><a href=\"https://dil.ie/41608\">tre</a> + <a href=\"https://dil.ie/41798\">tren</a> + cerdaib</td>\n<td></td>\n<td>through + strong + arts</td>\n</tr>\n<tr>\n<td>44</td>\n<td>druag</td>\n<td><a href=\"https://dil.ie/18853\">druí</a></td>\n<td>gen. s.</td>\n<td>druid</td>\n</tr>\n<tr>\n<td>45</td>\n<td>Nimcredbod</td>\n<td>ni + me + <a href=\"https://dil.ie/12821\">credbaid</a></td>\n<td></td>\n<td>does not + me + shrink, consume, gnaw</td>\n</tr>\n<tr>\n<td>46</td>\n<td>catha</td>\n<td><a href=\"https://dil.ie/8344\">cath</a></td>\n<td>gen.</td>\n<td>of battle</td>\n</tr>\n<tr>\n<td>47</td>\n<td>f()c()cha (fricricha)</td>\n<td><a href=\"https://dil.ie/24329\">fri</a> + <a href=\"https://dil.ie/12912\">crich</a></td>\n<td>acc.</td>\n<td>against, towards + land, territory</td>\n</tr>\n<tr>\n<td></td>\n<td>Line 6.</td>\n<td></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>48</td>\n<td>nesit-</td>\n<td><a href=\"https://dil.ie/33134\">nesaigid</a></td>\n<td>past pass.</td>\n<td>were wounded</td>\n</tr>\n<tr>\n<td>49</td>\n<td>mede</td>\n<td><a href=\"https://dil.ie/31852\">méit</a> or <a href=\"https://dil.ie/31755\">meide</a> or <a href=\"https://dil.ie/31721\">med</a></td>\n<td></td>\n<td>size, greatness or nape, corpse or match, equal opponent</td>\n</tr>\n<tr>\n<td>50</td>\n<td>midege</td>\n<td><a href=\"https://dil.ie/32160\">midach</a></td>\n<td>pl.?</td>\n<td>champion, hero / valiant</td>\n</tr>\n<tr>\n<td>51</td>\n<td>fornemairces</td>\n<td>for + <a href=\"https://dil.ie/33070\">nem</a> + <a href=\"https://dil.ie/1779\">aircisid</a></td>\n<td>3rd s. pres. ind.</td>\n<td>on/upon + heaven + meet/encounter</td>\n</tr>\n<tr>\n<td>52</td>\n<td>f-luachoir</td>\n<td>for + <a href=\"https://dil.ie/30761\">lúachair</a> or <a href=\"https://dil.ie/30762\">lúachair</a></td>\n<td></td>\n<td>on/upon + rushes (i.e. the plant) or brightness, brilliance</td>\n</tr>\n<tr>\n<td>53</td>\n<td>loisces</td>\n<td><a href=\"https://dil.ie/30563\">loiscid</a></td>\n<td>3rd. s. pres. ind.</td>\n<td>burns</td>\n</tr>\n<tr>\n<td>54</td>\n<td>ma+tal- (martal)</td>\n<td><a href=\"https://dil.ie/27721\">mar</a> + <a href=\"https://dil.ie/39932\">talam</a></td>\n<td></td>\n<td>as + the earth</td>\n</tr>\n<tr>\n<td>55</td>\n<td>tshuides</td>\n<td><a href=\"https://dil.ie/35940\">suidid</a></td>\n<td>3rd s. pres. ind.</td>\n<td>sits</td>\n</tr>\n<tr>\n<td></td>\n<td>Line 7.</td>\n<td></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>56</td>\n<td>ma+torain- (martorainn)</td>\n<td><a href=\"https://dil.ie/27721\">mar</a> + <a href=\"https://dil.ie/41429\">torann</a></td>\n<td></td>\n<td>as + thunder, battle din</td>\n</tr>\n<tr>\n<td>57</td>\n<td>trogais</td>\n<td><a href=\"https://dil.ie/41996\">trogaid</a> or <a href=\"https://dil.ie/41998\">trogain</a></td>\n<td>3rd s. pres. ind.</td>\n<td>gives birth, brings forth or sunrise, daybreak (metaph. “sun-birth”)</td>\n</tr>\n<tr>\n<td>58</td>\n<td>ni</td>\n<td><a href=\"https://dil.ie/33147\">ni</a></td>\n<td></td>\n<td>not</td>\n</tr>\n<tr>\n<td>59</td>\n<td>comairsid</td>\n<td><a href=\"https://dil.ie/10641\">comaircid</a></td>\n<td></td>\n<td>inquires, asks / cries out</td>\n</tr>\n<tr>\n<td>60</td>\n<td>f()cechnaie (fricechnaie)</td>\n<td><a href=\"https://dil.ie/24329\">fri</a> + <a href=\"https://dil.ie/7528\">cech</a> + <a href=\"https://dil.ie/33235\">naie</a></td>\n<td></td>\n<td>to + every + one</td>\n</tr>\n<tr>\n<td>61</td>\n<td>go</td>\n<td></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>62</td>\n<td>comair</td>\n<td><a href=\"https://dil.ie/10630\">comair</a></td>\n<td>adj</td>\n<td>in front of</td>\n</tr>\n<tr>\n<td>63</td>\n<td>ogma</td>\n<td><a href=\"https://dil.ie/33573\">Ogma</a></td>\n<td></td>\n<td>Ogma</td>\n</tr>\n<tr>\n<td>64</td>\n<td>sachu</td>\n<td><a href=\"https://dil.ie/38252\">sochonn</a>?</td>\n<td></td>\n<td>wise?</td>\n</tr>\n<tr>\n<td>65</td>\n<td>go</td>\n<td></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td></td>\n<td>Line 8.</td>\n<td></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>66</td>\n<td>comair</td>\n<td><a href=\"https://dil.ie/10630\">comair</a></td>\n<td>adj</td>\n<td>in front of</td>\n</tr>\n<tr>\n<td>67</td>\n<td>ne-</td>\n<td><a href=\"https://dil.ie/33070\">nem</a></td>\n<td></td>\n<td>heaven</td>\n</tr>\n<tr>\n<td>68</td>\n<td>agus</td>\n<td></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>69</td>\n<td>talom</td>\n<td><a href=\"https://dil.ie/39932\">talam</a></td>\n<td>Nom. S.</td>\n<td>earth</td>\n</tr>\n<tr>\n<td>70</td>\n<td>go</td>\n<td></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>71</td>\n<td>comair</td>\n<td><a href=\"https://dil.ie/10630\">comair</a></td>\n<td>adj.</td>\n<td>in front of</td>\n</tr>\n<tr>\n<td>72</td>\n<td>g()oa- (grioan)</td>\n<td><a href=\"https://dil.ie/26628\">grían</a></td>\n<td>dat.</td>\n<td>the sun</td>\n</tr>\n<tr>\n<td>73</td>\n<td>agus</td>\n<td></td>\n<td>conj.</td>\n<td>and</td>\n</tr>\n<tr>\n<td>74</td>\n<td>esa+u</td>\n<td><a href=\"https://dil.ie/20410\">ésca</a></td>\n<td>dat.</td>\n<td>moon</td>\n</tr>\n<tr>\n<td>75</td>\n<td>Drem</td>\n<td><a href=\"https://dil.ie/18631\">dremm</a></td>\n<td>nom.</td>\n<td>band, company</td>\n</tr>\n<tr>\n<td>76</td>\n<td>niadh</td>\n<td><a href=\"https://dil.ie/33151\">nia</a></td>\n<td>pl. gen.</td>\n<td>warrior, champion</td>\n</tr>\n<tr>\n<td>77</td>\n<td>mo</td>\n<td><a href=\"https://dil.ie/32400\">mo</a></td>\n<td>pro.</td>\n<td>my</td>\n</tr>\n<tr>\n<td>78</td>\n<td>dreimsie</td>\n<td><a href=\"https://dil.ie/18631\">dremm</a> + <a href=\"https://dil.ie/38191\">so</a></td>\n<td>Noun</td>\n<td>band, company + this / emphatic</td>\n</tr>\n<tr>\n<td>79</td>\n<td>duib</td>\n<td><a href=\"https://dil.ie/18985\">dub</a></td>\n<td>adj</td>\n<td>black, dark or massive, great</td>\n</tr>\n<tr>\n<td></td>\n<td>Line 9.</td>\n<td></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>80</td>\n<td>Moslu-so</td>\n<td><a href=\"https://dil.ie/32400\">mo</a> + <a href=\"https://dil.ie/37981\">slúag</a> + <a href=\"https://dil.ie/38191\">so</a></td>\n<td></td>\n<td>my + army + this, here / emphatic</td>\n</tr>\n<tr>\n<td>81</td>\n<td>slu-</td>\n<td><a href=\"https://dil.ie/37981\">slúag</a></td>\n<td>nom.</td>\n<td>host, army, war assembly</td>\n</tr>\n<tr>\n<td>82</td>\n<td>mor</td>\n<td><a href=\"https://dil.ie/32548\">mor</a></td>\n<td>adj</td>\n<td>great, big</td>\n</tr>\n<tr>\n<td>83</td>\n<td>murnech</td>\n<td><a href=\"https://dil.ie/32798\">muirnech</a></td>\n<td>adj</td>\n<td>spirited, tumultuous, rowdy, joyous</td>\n</tr>\n<tr>\n<td>84</td>\n<td>mochtsailech</td>\n<td><a href=\"https://dil.ie/32411\">moch</a> or <a href=\"https://dil.ie/32422\">mochta</a> + <a href=\"https://dil.ie/35988\">saílech</a> or <a href=\"https://dil.ie/35989\">saílechtu</a></td>\n<td></td>\n<td>early, speedy or great, mighty + thoughtful, hopeful or hope</td>\n</tr>\n<tr>\n<td>85</td>\n<td>bruithe</td>\n<td><a href=\"https://dil.ie/7139\">bruithe</a> or <a href=\"https://dil.ie/7090\">bruid</a></td>\n<td>past part.?</td>\n<td>boiling, melting</td>\n</tr>\n<tr>\n<td>86</td>\n<td>nt-oirech (nertoirech)</td>\n<td><a href=\"https://dil.ie/33116\">nert</a> + <a href=\"https://dil.ie/1895\">airech</a></td>\n<td>pl.</td>\n<td>strength + nobles, lords</td>\n</tr>\n<tr>\n<td>87</td>\n<td>rogeno+ (rogenoir)</td>\n<td><a href=\"https://dil.ie/25186\">gainithir</a></td>\n<td>pret. 3rd? s? intrans.</td>\n<td>is/are born</td>\n</tr>\n<tr>\n<td></td>\n<td>Line 10.</td>\n<td></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>88</td>\n<td>et- (etir)</td>\n<td><a href=\"https://dil.ie/20789\">etir</a></td>\n<td></td>\n<td>between</td>\n</tr>\n<tr>\n<td>89</td>\n<td>dacri</td>\n<td><a href=\"https://dil.ie/14080\">da</a> + <a href=\"https://dil.ie/12895\">crí</a></td>\n<td></td>\n<td>two + shapes, forms, bodies</td>\n</tr>\n<tr>\n<td>90</td>\n<td>ataf-roi</td>\n<td><a href=\"https://dil.ie/4927\">attá</a> + <a href=\"https://dil.ie/22676\">fo-fich</a></td>\n<td>3rd. s. perf. pres. subj.</td>\n<td>would, could attack</td>\n</tr>\n<tr>\n<td>91</td>\n<td>cath</td>\n<td>cath</td>\n<td></td>\n<td>battle, war</td>\n</tr>\n<tr>\n<td>92</td>\n<td>comortai</td>\n<td><a href=\"https://dil.ie/10761\">comart</a></td>\n<td></td>\n<td>mutual-striking</td>\n</tr>\n<tr>\n<td>93</td>\n<td>Arot’'i (Arotroi)</td>\n<td><a href=\"https://dil.ie/4913\">at-reig</a></td>\n<td>imp.</td>\n<td>Arise!</td>\n</tr>\n</tbody>\n</table>\n<hr>\n<h2 id=\"Notes-on-Words\">Notes on Words</h2>\n<p>1. “Arotroi” is hard to place, nothing like it appears in eDIL. Thankfully, we need not guess, since on <a href=\"https://archive.org/details/eriu_1916_8/page/173/mode/1up\">pg. 173 of Ériu 8</a>, within a transcription of the <em>Cath Airtig</em> from the Book of Lecan, we see a scribal note that reads <em>Arotroi (.i. eirig)</em>. <a href=\"https://dil.ie/4913\">Eirig (At-reig)</a> is established to mean “rise up”, or here, “Arise!”.</p>\n<p>3. eDIL lists this word as a verbal noun of <a href=\"https://dil.ie/12254\">con-oirg</a>, meaning “mutual striking” or “striking together”, implying that the battle in question here is one of two armies striking together in mutual slaughter.</p>\n<p>6. <a href=\"https://dil.ie/25277\">gal</a> is listed as “heat, mental hotness”, and <em>irgal</em> is listed as a compound with <a href=\"https://dil.ie/21985\">fichid</a> to mean “battle heat, fury”, and <em>cathirgal</em> appears under <a href=\"https://dil.ie/8344\">cath</a> meaning “battle-fury”. <em>irgal</em> appears in the entry for <a href=\"https://dil.ie/17143\">do-airissedar</a>, where <em>tarrassaid inn irgal</em> is translated as “the conflict paused”. Here we can take <em>cathirgal</em> to be one word, since there is no spacing between letters in the manuscript, and the meaning then becomes something like “the battle-fury broke”.</p>\n<p>7. This word usually means “breaks, smashes” according to eDIL, but when combined with <em>cath</em> or <em>irgal</em>, etc, which it is here, then means “overthrows, defeats, routs”.</p>\n<p>8. In the same way as <em>comlann</em> is given as <em>com</em> + <em>lán</em>, “equally + full”, I take this word as <em>com</em> + <em>lond</em>, “equally + fierce, angry”. Mees renders this word as “with fury”, which I essentially agree with. The word-final ‘o’ can be an adjectival suffix. In trying to figure out this sentence, I also take this adjective <em>comlondo</em> to be attached to the verb <em>robris</em>, acting as an adverbial modifier giving a meaning of “breaks fiercely” or “overthrows furiously”, which again essentially agrees with Mees’ translation.</p>\n<p>9. The first part is obviously <em>for</em>. The second part could be <a href=\"https://dil.ie/37871\">slecht</a>, a noun, meaning a division or the act of hewing, or <a href=\"https://dil.ie/37939\">sligid</a>, a verb, meaning similarly to cut, hew, or throw down (i.e. an army). Both words, and both constructions (i.e. noun or verb) essentially describe the army in question as one that hews habitually, so we can give the English translation of “hewing host” or “over-slaughtering army”, once again in agreement with Mees’ translation. The word-final macron can be assumed as a conjugational ending or declension, and likely monosyllabic, probably <em>slechta</em> or even <em>slechtaib</em>. It can go either way, but I take this word to be the verbal noun of <em>sligid</em>, giving us “upon/on the hewing hosts”.</p>\n<p>10. Following the discussion in Note 9, I take <em>slu-</em> here to be <em>slúaig</em>, that is “slúag” in the genitive, since for the noun “forslecht” to describe the <em>slúag</em> we must have <em>forslecht slúaig</em> “the hewing of the host”, or perhaps it is merely <em>forslecht slúag</em> “the hewing of the hosts”.</p>\n<p>13. This word is derived either from <a href=\"https://dil.ie/37365\">síabraid</a> or <a href=\"https://dil.ie/37359\">síabair</a>, with the latter pertaining to supernatural beings, phantoms, specters, etc. according to eDIL, and which agrees with Mees’ and Carmody’s translations of this word as “phantom”, and with the former meaning “enchanted, aroused, whipped into a fury, even to a supernatural fury”. I take the former derivation to be superior on the grounds of meaning, since there is no indication of a “phantom host” otherwise, but Lugh is engaging in the act of bewitching and arousing his army through incantation, so this is the army before which is the destruction.</p>\n<p>17. See also this word referenced in <a href=\"https://dil.ie/14268\">daire</a>, taken to mean an animal den or thicket.</p>\n<p>18. The combination of <em>cuife</em> and <em>cithai</em> makes no sense. The words may even be one word that is split in half by a line break. Mees reads this as <em>cuifecithai</em> “comes together”, and Carmody as “set aside”. Mees’ translation is a reasonable one—he renders it as a form of <em>com</em> + <em>fichid</em>, and we see in eDIL under the entry for <a href=\"https://dil.ie/10554\">com</a>: “Before f (earlier *w) co (cóir), later cob cub (cobair, cobodail, cubaid, cubus, cobfolaid, cobfuil).” With an established -b form of <em>com</em>, he adds <a href=\"https://dil.ie/21985\">fichid</a> which takes on some conjugation, perhaps a form of the preterite singular <em>fechtae</em> “he fought” or passive present plural <em>fichitir</em> “they (pass.) fight”. We can imagine that there is some dialect variance at play, or that the scribe was copying words he didn’t understand the meaning of (pure conjecture of course). I propose that this word is a compound noun of <em>cuife</em>, “cave, den”, and “cit”, “sheep”, the latter of which is a form of <a href=\"https://dil.ie/8919\">cethnat</a> as listed on eDIL, or of <a href=\"https://dil.ie/9260\">cith</a> which is identified with <a href=\"https://dil.ie/13507\">cuilén</a>, “pup, cub”. In any case, giving a meaning of “a den of young pups / sheep”.</p>\n<p>21. This word is either <em>lentar</em>, as listed in eDIL for the present passive singular, or a compound of <em>lent</em>/<em>lend</em> + <em>ar</em>, a 3rd person present active, with a meaning of “stays attached to, clings to”. eDIL gives an example of the latter as “co rralsat sis anchoram; ro lend ar bendchopor in derthaige”, giving us a perfect example of <em>lent ar</em> elsewhere. <em>lentar</em> is used more flexibly as a regular passive verb. Along with the next word, <em>gala</em>, we have a meaning of “adhering/one adheres to valor” or “staying/one stays attached to warlike fury”, etc, and a broader meaning of <em>cuife cithai fir gen rogain lentor gala</em>, “a den of sheep are men without wills which adhere to war-fury”.</p>\n<p>24. This word is seldom attested, and was only identified 20 years ago by Liam Bretnach, see <a href=\"https://en.wiktionary.org/wiki/domaisi#Old_Irish\">here</a>, but nonetheless fits perfectly. This would then be an elsewhere-unattested 3rd person plural active indicative form. We could take a meaning of “over-cunning” or “over-scheming”.</p>\n<p>27. See the note in eDIL for <a href=\"https://dil.ie/23272\">for</a>, which explains the use of <em>fora</em> + <em>n-</em> in a relative clause which allows for the word to take the form of <em>fora</em>.</p>\n<p>28. In the <a href=\"https://dil.ie/14925\">eDIL listing</a> for <em>dechraigidir</em>, we see an identical form in <em>fria ndechraiged</em>, a preterite subjunctive 3rd person singular. So it is tempting to break with pattern and interpret the macron over the ‘f’ which begins this word as <em>friandechraiged</em> instead of <em>forandechraiged</em>, but I find it more likely that this word continues the series of <em>for</em> words. The word should be taken as <em>fora n-dechraiged</em>. As for meaning, this would indicate that the ‘fir’ subsequently mentioned distinguish themselves; we can translate this as “greatly distinguished”.</p>\n<p>30. <em>duib</em> or <em>dub</em> has the meaning of “black”, but also of “great, mighty” or “dire,” and is used later interchangeably or with <em>mór</em>. However here I will take it to mean “black” or “dark”. Mees and Daimler use this word when it appears later to mean “to you”, with the modern Irish meaning of <em>daoibh</em>, but I find a form of <em>dub</em> “black” to be far more likely on grounds of grammar and meaning.</p>\n<p>33. An alternate reading is <em>nomtam-</em>, an ambiguity which Thurneysen notes, but I view <em>nomtain-</em> as the far more likely reading due to the subtle serif on the middle downstroke of the supposed ‘-m’, indicating that this is actually an <em>-in</em>. This also allows us to accurately evaluate the macron over the ‘n’, as being a common double ‘n’ ending, whereas an ‘m’ ending leaves us with no clear option for the macron. I would like for this word to be a form of something like <em>nomtaid</em>, but there is no such word in any dictionary, so I must interpret this as a compound of <em>noíb</em> + <em>táinn</em>, with a meaning of “sacred, holy + raid, driving-off”, essentially describing what the Tuatha Dé intends to enact upon the Fomorians. The word then is a verb meaning “drives off, raids”. eDIL attests that in Middle Irish the former word is more often written as <em>noem</em>, or similar forms, over <em>noíb</em>. The latter word is well known, but does not appear listed with a double <em>-nn</em> ending; this may be a scribal variation, but may also indicate that the second word is truly a form of <a href=\"https://dil.ie/40004\">tain</a>, meaning “time, while, occurrence”. This meaning is linguistically safer, however on grounds of meaning alone I find this alternative less likely, since “sacred time, holy time” would seemingly be disconnected from any established meaning in this line. However, I am ultimately not very confident in this translation because of the unaccounted-for <em>-nn</em> ending and the leap required to make this a verb. It is also possible that the initial word <em>noem</em> is the final afjective in the list and not connected to <em>tainn</em>.</p>\n<p>34. This word has a more literal meaning of “good”, but I translate it as “joy”, to better contrast with the following “woe!” It may be simply a feature of English that woe is thing that is felt, so to keep the pairing consistent, <em>fo .i. maith</em> must likewise become a “goodness that is felt” i.e. joy.</p>\n<p>40. <em>no efit-</em>, or <em>noefit-</em> as Thurneysen gives it, is perhaps the most difficult word in this text. Nothing even close to it appears in eDIL or any other common dictionary. So the following explanation will be only tentative at best. However, I suspect this is a compound of <a href=\"https://dil.ie/33244\">noíb</a> + <a href=\"https://dil.ie/34382\">pít</a>; the first element means “holy, sacred”, and is also in my explanation of <em>nomtainn</em> in Note 33, the latter is <em>-fit</em>, a later version of the word <em>pít</em>, meaning a food or ration. This latter element is shown to be used in compound words as the secondary element, such as <em>doborfiit</em>, “water-diet” (i.e. a monk’s fasting), or <em>tercphit</em>, “meager-rations”, and is identified with the Old Irish word <em>proind</em> as well as the Latin <em>uita</em> or <em>vita</em>, meaning the food that sustains one’s life. The initial element <em>noe</em> is a form of <em>noíb</em> or <em>noem</em>, but then we must explain why in <em>nomtainn</em> this word appears with an ‘m’ and in this word without a final ‘m’: this is caused by lenition of the final ‘m’ between two slender vowels with the latter word’s ‘f’ preserved (phonologically the lenited ‘m’ -&gt; ‘v’ may sound identical to an ‘f’). We see the word <em>noem</em> with a lenited ‘m’ in many compounds in the eDIL entry: <em>naem</em> + <em>fót</em> = <em>naomhfód</em>, <em>naem</em>+ <em>port</em> = <em>naomhport</em>, or <em>noem</em> + <em>erlam</em> = <em>naomhērlamh</em>. The ‘m’ in <em>nomtainn</em> remains because of two surrounding broad vowels, which is seen also in eDIL, e.g. <em>noemcorp</em>. Thus, accounting for the macron, we have <em>noefita</em> meaning “holy food” or “divine sustenance”.</p>\n<p>41. This word is truly hard to read. The manuscript shows four downstrokes for the final letter(s), which could be, most likely, either an “-im” or an “-nn”. To me there seems to be a slightly larger serif on the second downstroke, implying an “-im” ending and giving this word as “maim-”, with a macron still to be accounted for. The word is ultimately thus a form of the word <em>mám</em> such as <em>máime</em> (gen. s.). A genitive form is given in eDIL to show a unit of measure, e.g. <em>lán máime</em> “full of a fist” or “a fist full”, and we could have a unit of measurement for the supposed <em>fit</em> “food” in the previous word.</p>\n<p>42. <em>scoth-</em> I resolve as <a href=\"https://dil.ie/36595\">scothach</a>, meaning “flowery, bushy, tufted”, a good descriptor of the cloud <em>nel</em> that precedes it. The final letter ‘h’ with a macron is unusual, since most lenition in this manuscript is indicated by a <em>fada</em> over the letter instead. Yet a few lines earlier, right before the poem’s beginning, there is another h-with-macron at the end of the word which Stokes renders as <em>timchell</em>. So the h-with-macron is used to show lenition as well as a common ending that could be multiple letters in length. Therefore, we can select the most reasonable ending from eDIL and apply it, which to me is <em>scothach</em>, giving us “fluffy clouds”.</p>\n<p>43. The first element is clearly <a href=\"https://dil.ie/41608\">tre</a>, “through”, followed by <a href=\"https://dil.ie/41798\">tren</a>, “strong”, but then we find a ‘c’, a macron, and a suffix <em>-daib</em>. Thurneysen renders this as <em>cerdaib</em>, meaning “arts”, which I am not opposed to. The macron allows for an arbitrary letter or string of letters to fill in, but whatever is there should be something monosyllabic, as this seems to be the typical use of other macrons. eDIL offers some examples of words that fit this description: “chladaib”, “chlandaib”, “cruadaib”, “cerdaib”, “cendaib”, etc. But the meaning of “cerdaib” fits well in Lugh’s oration, giving us <em>trie trén cerdaib druag</em> “through strong druid arts”. See <a href=\"https://dil.ie/15847\">2 día</a> for occurrences of the phrase <em>cerdaib dé druidechtai</em>, which seems to be a common phrase that is echoed here.</p>\n<p>45. This compound word, <em>nimcredbod</em>, is likely <em>ni + me +</em> (a form of) <em>credbaid</em>. The passage in this poem is cited directly in the eDIL entry for <a href=\"https://dil.ie/12821\">credbaid</a>. Also, a nearly identical formation appears in the <em>Cath Airtig</em> text presented in <a href=\"https://archive.org/details/eriu_1916_8/page/172/mode/1up\">Ériu 8, pg. 172</a>, which gives a similar magical song; there it appears as <em>nom credbad</em>. <em>credbod</em> is the verbal noun of <em>credbaid</em>, and when combined with the next word <em>catha</em>, gives the meaning of “battle does not wither/weary/corrode me”.</p>\n<p>47. This word is much compacted, using two superscript marks to abbreviate. Previously when the scribe had used a mark over an ‘f’, Stokes took it to mean ‘fr’ or even ‘fri’, so I will defer to his interpretation. He transcribes the mark below as <em>friu</em> a few pages previously: <div><img src=\"FRIU.png\" alt=\"\" class=\"same-size\" style=\"width: 225px;\"/></div></p>\n<p>48. I take this as a verbal form of <a href=\"https://dil.ie/33129\">3 ness</a>, which in the eDIL entry references O’Davoren’s Glossary which equates <em>nes .i. crecht</em>. <a href=\"https://dil.ie/12800\">Crecht</a> has an established meaning of “wound”, and the verb <a href=\"https://dil.ie/33134\">nesaigid</a> means the same. Or the form <em>nesit</em> may be the 3rd. person singular of a verb <em>nesaid</em> or <em>nessa</em> which is unlisted in eDIL, but which the scribe may have neologized from the listed word <em>ness</em>, which is common in Old Irish (see Thurneysen’s <em>A Grammar of Old Irish</em> section 524, on adjectives turning into verbs). But as regards the macron over the final ‘t’, I suspect this is a final ‘-he’ or ‘-ha’ which would present us with an imperfect passive form of <em>nesaigid</em>, being <em>nesithe</em> or <em>nesitha</em>, “were wounded”. The more proper form, however, would be <em>nestae</em> or <em>nestha</em>, so I am not utterly convinced of this reasoning.</p>\n<p>49. To me the most probable established word compatible here is <a href=\"https://dil.ie/31755\">meide</a>, meaning the trunk of a neck and figuratively a corpse; I view it as most probable because we have instances in eDIL of this word appearing as <em>mede</em>, e.g. <em>méde fri méde</em> or <em>médhe</em>. With <em>nesit-</em> or <em>nesitha</em> as a past participle, we could read “corpses were wounded”.</p>\n<p>50. <em>midige</em> is given in the eDIL listing as an adjective in <em>do thig na mná mídige</em> “the valiant women came”. We can take this as a spelling variant, applying to the</p>\n<p>51. Mees’ translation renders this line <em>fornem airces</em> “Such splendor which slays”. He considers <em>fornem</em> as one word, where I consider it <em>for + nem</em>. Further, he then interprets the word as <a href=\"https://dil.ie/23821\"><em>forníam</em></a>, which I grant is entirely plausible due to scribal variation, but which, according eDIL, is a different word from <a href=\"https://dil.ie/23813\"><em>fornem</em></a> itself. Still, the eDIL entry links the meaning back to “heaven”, so if he wanted to avoid this interpretation in order to make sense of the sentence, he may be right. As for <em>airces</em>, it is a form of <a href=\"https://dil.ie/1779\">aircisid</a> with an unusual <em>-es</em> ending; however, see in Note 53 that this <em>-es</em> ending is used for a 3rd person singular present indicative, so I will render it as “meets”.</p>\n<p>52. <em>lúachoir</em> here can either mean “rushes”, the plant, which burn quite ferociously when dry, or “brightness”, the end result of fire. Either are good candidates for what burns here; however, since the previous formulation implies “meeting <em>with</em>” or “attaining <em>to</em> heaven”, I will take this word as meaning “burning <em>to</em> brightness”.</p>\n<p>53. A form of <em>loiscid</em> with an <em>-es</em> ending is hard to find documented, but it appears in <em>Ériu</em> Vol. VII, pg. 160, in the following sentence: <em>is besad in tineth is cuma <strong>loisces</strong> a mbis issa ⁊ huasa ⁊ inna erchomair</em>, translated by Gwynn as “For it is the way of fire that it <strong>burns</strong> indifferently what is below and above and near it”. <em>loisces</em> is given as a simple 3rd person singular present indicative, so I will render it the same here.</p>\n<p>54. <em>mar</em> here is unresolved, and <em>tal-</em> here is unresolved with a macron ending. The strange crossbar under the ‘a’ in the manuscript is seen elsewhere and Stokes resolves this symbol to be an ‘r’, giving <em>martal-</em>. Given that Word 56 is clearly <em>martorainn</em>, we can take this as a pattern which consists of <em>mar</em> + a disyllabic word beginning with ‘t’, and followed by a disyllabic verb. So we can then fill in the macron with the most expected ending for a word beginning with <em>tal-</em>, which would yield the word <em>talam</em>, “land, earth”. This fits nicely with the meaning of the next word, <em>tshuides</em> “sits”. <em>mar</em> can mean either “as” or “great”, giving us either “as the earth sits” or “the great earth sits”. Since <em>mar</em>, even in modern Irish, precedes the clause it acts upon, while <em>már</em> is an adjective that should come after the noun <em>talam</em>, I lean towards the former interpretation. <em>mar</em> meaning “as, such as” is also a development of Middle Irish, and so the other markers of Middle Irish in this poem allow us to take this word with its later meaning (see Stifter’s <em>Sengoídelc</em> pp. 308).</p>\n<p>59. Although <a href=\"https://dil.ie/10641\">comaircid</a> has a hard ‘k’ sound in the final ‘c’, the listing for <a href=\"https://dil.ie/10674\">comairser</a> wonders if <em>comaircid</em> can take forms, probably in the subjunctive, with a final ‘s’ sound instead. <em>mad fris gais comairser</em> “if thou consult wisdom”, under <a href=\"https://dil.ie/24352\">fris-comairc</a>. Perhaps this is a development in Middle Irish: we already see a ‘c’ and ‘s’ close together in <em>comaircsead</em> in the main listing. Perhaps palatalization is also at play. So I take this word to be a subjunctive 3rd person form of <em>comaircid</em>. I take its meaning as “cry out”. An alternative is a compound of <em>com</em> + <a href=\"https://dil.ie/4287\">airsid</a>, but with an unclear meaning “with + aged, veteran”.</p>\n<p>60. The final piece, <em>naie</em>, is unknown, but my best estimation is that it derives from <a href=\"https://dil.ie/33235\">nae</a>, “person”.  The alternatives are <a href=\"https://dil.ie/33243\">noí</a>, “nine”, or <a href=\"https://dil.ie/33205\">noe</a>, “boat”, but there seems to be sufficient spelling variation in the <em>nae</em> entry for this to be acceptable. And see this line in the <a href=\"https://dil.ie/33235\">eDIL entry</a>, <em>fercheirtní .i. fír cert naí .i. duine fīr-cherte</em>, which gives <em>fercheirtní</em> = <em>fer cheirt ní</em>, a triple word construction similar to <em>fricechnaie</em> = <em>fri cech nai</em>. The unaccounted-for final ‘e’ may then be merely a dialectical variation. This word appears similar to <a href=\"https://dil.ie/33151\">niae</a>, Word 76, but every form of this word begins with an ‘i’ and never a broad vowel.</p>\n<p>61. <em>go</em> and <em>comair</em> both indicate direction and meeting, so I translate this as “before”, indicating the listener approaching up to Ogma, sun and moon, earth and heaven, and standing before each. Under <a href=\"https://dil.ie/10630\">comair</a> we see an identical formulation: <em>co comor</em> “as far as opposite”.</p>\n<p>64. I cannot identify a solid translation of this word in this form. Mees renders it as “and also”; Carmody renders it as “good-hound”; LLMs similarly provide <em>sa-chú</em> as a guess. All unsatisfactory. I instead search for a homophonic word which is a reasonable candidate. We could read this word as <a href=\"https://dil.ie/35927\">saich</a>, meaning “bad, evil”, hardly an epithet of Ogma; <a href=\"https://dil.ie/38232\">sochar</a>, meaning “a valid legal contract”, a nonsensical meaning; <a href=\"https://dil.ie/36069\">saíthiud</a>, meaning “a fraud”, being unlikely; a form of <a href=\"https://dil.ie/36063\">sáithech</a>, meaning “satisfied (of appetite)”, which lists a homophonic comparative form <em>sathchu</em>; or my preferred <a href=\"https://dil.ie/38252\">sochonn</a>, meaning “wise”. This word <em>sochonn</em> lists a form as <em>sochuinn</em>, very near to our <em>sachu</em> save for a swapped vowel and a missing ending. I choose to use this word mainly on meaning in addition to phonetic similarity, as it is very proper to describe Ogma as wise, who is called a <em>treinfer</em>, “champion”, of the <em>Tuatha Dé</em>. Ultimately this word’s translation remains open to improvement.</p>\n<p>72. See the eDIL entry for <a href=\"https://dil.ie/26628\">grían</a>, which lists this as an example of the dative case of the word: <em>hi coimthect du gréin ┐ escu</em>; the exact formulation we have here. It clearly means “sun and moon”; see <a href=\"https://dil.ie/20410\">ésca</a>, which helps illuminates the phrase as it appears here.</p>\n<p>79. Note that in this word, we see the same subscripted ‘i’ that appears often after an ‘s’, as in <em>dreimsie</em>. I will take this word to mean “black”, and describe a “black host”, but a figurative meaning of <em>duib</em> is listed as “great, expressing intensity”, thus the line could also be “my host is a great host”, which is identical is meaning to the following line <em>mo slúag so slúag mor</em>. Mees takes this word as the pronoun equivalent to Mod. Ir. <em>daoibh</em> “to you all,” but I disagree.</p>\n<p>84. This word has two possibilities to me: the first part can be <a href=\"https://dil.ie/32411\">moch</a> or <a href=\"https://dil.ie/32422\">mochta</a>, and the second part either <a href=\"https://dil.ie/35988\">saílech</a> or <a href=\"https://dil.ie/35989\">saílechtu</a>. Both of the latter words mean “hope” or “thoughtful” in some form. <em>Moch</em> is given as “early, speedy”, and <em>mochta</em> is given as “mighty, great”. So the two possibilities then are 1) “early-thoughtful”, “quick-thoughtful”, perhaps “quickwitted” or 2) “mighty-thoughtful”, “greatly-thoughtful”, perhaps “strongminded”. When imagining this epithet applied to an eager army, I can only imagine that strength is emphasized over wit, so I prefer to render this word as “resolute” or “steadfast”. Also, if one chose to prefer <em>moch</em> over <em>mocht</em>, one would also have to account for the lost ‘t’ in <em>mochtsailech</em>.</p>\n<p>86. Examples of the o-form of <em>aire</em>/<em>airech</em> can be seen in the entry for <a href=\"https://dil.ie/1885\">3 aire</a>. eDIL also specifies that <a href=\"https://dil.ie/33116\">nert</a> can become adjectival when used as the primary element in a compound, with some examples, <em>co nertbáig</em> “with strong fight”, <em>nertbla</em> “mighty fame”, etc. Thus we have “mighty lords”.</p>\n<p>87. See <a href=\"https://dil.ie/16842\">díth</a> for <em>rogenair [Isu] ó Muire</em>, “Jesus born of Mary”, and under <a href=\"https://dil.ie/25186\">gainithir</a>, <em>is hé Crist rogenir</em>, “Christ is born”; <em>Rí rogenair imBetheil</em>, “King born in Bethlehem”; etc.</p>\n<p>89. The meaning of <em>da-</em> as “two” is supported by <em>etir</em>: “between” implies two things.</p>\n<p>90. The macron in this word indicates an <em>-or</em>, as in previous word with an f-macron. See <em>forslecht</em> (9) or <em>forandechraiged</em> (28). This occurrence, and the <em>arotroi</em> succeeding it, are listed in the entry for <a href=\"https://dil.ie/4919\">at-roí</a>, meaning “to fail”, with an unclear meaning. Isolde Carmody has seemingly accepted this association wholeheartedly, and translates <em>arotroi, arotrai</em>, and <em>ataforroi</em> as variations of the word “fail”; but this association seems tenuous, brought about by hitting a dead end regarding <em>arotroi</em> and <em>ataforroi</em>. Note 1 establishes <em>Arotroi</em> as “Arise!”, but <em>ataforroi</em> seems unrelated. Instead, I take it as <em>atá</em> + <em>forroi</em>, from <a href=\"https://dil.ie/22676\">fo-fich</a>, which lists <em>forroi</em> as its 3rd person present singular subjunctive form, ultimately implying that the subject may or hypothetically could attack, or which Lugh desires to attack. Thus, “which attacks” or even “poised to charge”.</p>\n<h2 id=\"Translation\">Translation</h2>\n<ol>\n<li>\n<p>Atroroi cat comartan isincathirgal robris comlondo forslechtaib slúaig</p>\n</li>\n<li>\n<p>silsiter riasluag sioabrai iath fer fomnai. cuife</p>\n</li>\n<li>\n<p>cithai fir genrogain lentor gala. fordomaisit fordomcloisid foran</p>\n</li>\n<li>\n<p>dechraiged fir duib becc find nomtainn. fó fó fé fé clé amainsi no</p>\n</li>\n<li>\n<p>efita máime iernelscothach trietrencerdaib druag. Nimcredbod catha fricricha</p>\n</li>\n<li>\n<p>nesitha mede midege fornemairces forluachoir loisces martalam tṡuides</p>\n</li>\n<li>\n<p>martorainn trogais. Nicomairsid fricechnaie gocomair ogma sachu go</p>\n</li>\n<li>\n<p>comair nem 7 talam go comair grioan 7 esqu. Drem níadh modremsie duib.</p>\n</li>\n<li>\n<p>Mo slúagso slúag mor murnech mochtsailech bruithe nertoirech rogenoir</p>\n</li>\n<li>\n<p>etir dacri ataforroi cath comortai. arotroi.</p>\n</li>\n<li>\n<p>Arise! Mutual battle in war-fury furiously overthrows the hewing hosts</p>\n</li>\n<li>\n<p>The lands of watchful men will be thrown down before the frenzied army.</p>\n</li>\n<li>\n<p>A den of sheep are men without wills which adhere to war-fury. Over-cunning,</p>\n</li>\n<li>\n<p>Over-hearkening, over-distinguished men, dark, few, bright, on a holy-raid. Joy! Joy! Woe! Woe! Evil! Thusly so! A handful of divine food</p>\n</li>\n<li>\n<p>Across the tufted clouds through strong druid arts. Battle against a land does not weary me</p>\n</li>\n<li>\n<p>Valiant corpses were wounded reaching heaven, burning to brilliance, as the earth sits</p>\n</li>\n<li>\n<p>As the thunder comes forth. Do not cry out to each one before wise Ogma,</p>\n</li>\n<li>\n<p>Before heaven and earth, before sun and moon. My dark troop is a troop of warriors.</p>\n</li>\n<li>\n<p>My army is a great army, uproarious, steadfast, boiling, mighty as lords, born</p>\n</li>\n<li>\n<p>Between two bodies which attack in battle of mutual slaughter. Arise!</p>\n</li>\n</ol>\n<hr>\n<h2 id=\"Meter-or-Arranging-the-Lines\">Meter, or Arranging the Lines</h2>\n<p>This incantation is a <em>rosc</em> poem, which typically in the Old Irish period consist of four-line stanzas with any number, but most often seven, syllables in each line, with alliteration within each line and each line rhyming within the stanza. As such, we can attempt to fit the text into the <em>rosc</em> pattern and see if it fits.</p>\n<p>If the curious reader wants a primer on Old Irish poetry, he should seek out Lesson 58 in David Stifter’s <a href=\"https://archive.org/details/SengodelcOldIrishForBeginn\"><em>Sengoídelc: Old Irish for Beginners</em></a>, which goes over meter, rhyme, stanzas, syllable count, cadence, etc. One point I’d like to lift from that text to this one is the following: “Whereas in [English or German] the rhyming portions of words must be absolutely identical, there is much more freedom is Irish poetry… Rhyme starts with the stressed vowel… the two vowels must both be either short or long; a short vowel does not rhyme with a long one.” He offers a footnote: “In Middle Irish, after unstressed vowels had become /ə/, all finals vowels, whatever their origin, rhyme with each other.” Since this <em>rosc</em> shows clear signs of composition in Middle Irish, we can keep this rhyme qualification in mind. I should also note that in Old and Middle Irish, stress mot often falls on the first syllable of the word, unless that syllable is a common preposition that is not the root. For example, COMartan, MURNech, MIDege, SILsiter, but also foraNDECHraiged, nimCREDbod, genROGain.</p>\n<table>\n<thead>\n<tr>\n<th>Line</th>\n<th>Syllables</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Atroroi cat comartan</td>\n<td>7</td>\n</tr>\n<tr>\n<td>isin cathirgal robris</td>\n<td>7</td>\n</tr>\n<tr>\n<td>comlondo forslechtaib slúaig</td>\n<td>7</td>\n</tr>\n<tr>\n<td>silsiter riasluag sioabrai</td>\n<td>7</td>\n</tr>\n<tr>\n<td> </td>\n<td></td>\n</tr>\n<tr>\n<td>iath fer fomnai.</td>\n<td>4</td>\n</tr>\n<tr>\n<td>cuifecithai</td>\n<td>4</td>\n</tr>\n<tr>\n<td>fir genrogain</td>\n<td>4</td>\n</tr>\n<tr>\n<td>lentor gala.</td>\n<td>4</td>\n</tr>\n<tr>\n<td> </td>\n<td></td>\n</tr>\n<tr>\n<td>fordomaisit</td>\n<td>4</td>\n</tr>\n<tr>\n<td>fordomcloisid</td>\n<td>4</td>\n</tr>\n<tr>\n<td>forandechraiged</td>\n<td>5</td>\n</tr>\n<tr>\n<td>fir duib becc find</td>\n<td>4</td>\n</tr>\n<tr>\n<td> </td>\n<td></td>\n</tr>\n<tr>\n<td>nomtainn. fó fó fé fé</td>\n<td>6</td>\n</tr>\n<tr>\n<td>clé amainsi</td>\n<td>4</td>\n</tr>\n<tr>\n<td>noefita máim</td>\n<td>4</td>\n</tr>\n<tr>\n<td>iernelscothach</td>\n<td>4</td>\n</tr>\n<tr>\n<td> </td>\n<td></td>\n</tr>\n<tr>\n<td>trietrencerdaib druag.</td>\n<td>5</td>\n</tr>\n<tr>\n<td>Nimcredbod catha</td>\n<td>5</td>\n</tr>\n<tr>\n<td>fricricha nesitha</td>\n<td>5</td>\n</tr>\n<tr>\n<td>mede midege</td>\n<td>5</td>\n</tr>\n<tr>\n<td> </td>\n<td></td>\n</tr>\n<tr>\n<td>fornemairces</td>\n<td>4</td>\n</tr>\n<tr>\n<td>forluachoir loisces</td>\n<td>5</td>\n</tr>\n<tr>\n<td>martalam tṡuides</td>\n<td>5</td>\n</tr>\n<tr>\n<td>martorainn trogais.</td>\n<td>5</td>\n</tr>\n<tr>\n<td> </td>\n<td></td>\n</tr>\n<tr>\n<td>Nicomairsid fricechnaie</td>\n<td>7</td>\n</tr>\n<tr>\n<td>go comair ogma sachu</td>\n<td>7</td>\n</tr>\n<tr>\n<td>go comair nem ⁊ talam</td>\n<td>7</td>\n</tr>\n<tr>\n<td>go comair grioan ⁊ esqu</td>\n<td>7</td>\n</tr>\n<tr>\n<td> </td>\n<td></td>\n</tr>\n<tr>\n<td>Drem níadh mo dremsie duib</td>\n<td>7</td>\n</tr>\n<tr>\n<td>Mo sluagso sluag mor</td>\n<td>7</td>\n</tr>\n<tr>\n<td>murnech mochtsailech</td>\n<td>5</td>\n</tr>\n<tr>\n<td>bruithe nertoirech</td>\n<td>5</td>\n</tr>\n<tr>\n<td> </td>\n<td></td>\n</tr>\n<tr>\n<td>rogenoir etir dacri</td>\n<td>7</td>\n</tr>\n<tr>\n<td>ataforroi</td>\n<td>4</td>\n</tr>\n<tr>\n<td>cath comortai. arotrai.</td>\n<td>7</td>\n</tr>\n</tbody>\n</table>\n<p>The stanza starting with <em>Nicomairsid</em> is an anchor point in the incantation: it cleanly contains four perfect lines of seven syllables each, similar to the first stanza <em>Arotroi</em>. All other lines can be fit between these two. It seems that in this <em>rosc</em>, syllable count is not so strict. Arranging lines by rhyme, we see that the syllable count switches between 4, 5, 6, and 7 per line throughout the poem, with certain lines breaking the pattern (<em>forandechraiged</em>, <em>fornemairces</em>, and <em>nomtainn</em>), along with the final three(?) lines which don’t seem to rhyme or fit. It is possible that these aberrant words underwent elision on weak letters to shorten them or hiatus to extend them, e.g. <em>forandechrai<strong>g</strong>ed</em> (5) -&gt; <em>forandechrai<strong>gh</strong>ed</em> (5) -&gt; <em>forandechraied</em> (4). But these aberrant lines are the exception to an otherwise regular meter.</p>\n<p>It is also possible to ignore rhyme and arrange the poem into stanzas of perfect seven syllable lines, though it is less satisfactory, however the lines I’ve proposed are also quite unsatisfactory. It appears that this poem is simply not regularly composed in rhyme or syllable count. Mees calls the middle section ‘garbled… copied… from a much earlier manuscript’; I was struck with the impression that the scribe may have had this poem read aloud to him by another person. Either way, this is a difficult poem which remains open to amendation.</p>\n<p>This also appears to be a poem composed in an Old Irish fashion, but modernized to Middle Irish through the use of new words, new forms of words, new uses for old words, etc.</p>\n<p>So, my version in English:</p>\n<p>Arise! Mutual battle<br>\nin war-fury overthrows<br>\nfuriously the hewing hosts,<br>\nthe lands of watchful men</p>\n<p>will be thrown down before the frenzied army.<br>\nA den of sheep<br>\nare men without wills<br>\nwhich adhere to war-fury.</p>\n<p>Over-cunning,<br>\nOver-hearkening,<br>\nover-distinguished<br>\nmen, dark, few, bright,</p>\n<p>on a holy-raid. Joy! Joy! Woe! Woe!<br>\nEvil! Thusly so!<br>\nA handful of divine food<br>\nAcross the tufted clouds</p>\n<p>through strong druid arts.<br>\nBattle against a land<br>\ndoes not weary me,<br>\nvaliant corpses were wounded</p>\n<p>reaching heaven,<br>\nburning to brilliance,<br>\nas the earth sits,<br>\nas the thunder comes forth.</p>\n<p>Do not cry out to each one<br>\nbefore wise Ogma,<br>\nbefore heaven and earth,<br>\nbefore sun and moon.</p>\n<p>My dark troop is a troop of warriors.<br>\nMy army is a great army,<br>\nuproarious, steadfast,<br>\nboiling, mighty lords</p>\n<p>are born between two bodies<br>\nwhich attack<br>\nin battle of mutual slaughter. Arise!</p>\n<h2 id=\"An-Instance-of-Corrguinecht\">An Instance of <em>Corrguinecht</em></h2>\n<p>This chant is more prominent than the others in the <em>Cath</em> due to the unusual stance which Lugh takes while reciting it: one-eyed, one-legged, and one-armed, circling the <em>Tuatha Dé</em> army.</p>\n<blockquote><p>Wherefore then Lugh sang this chant below, as he went round the men of Erin, on one foot and with one eye (closed):</p>\n<footer><strong>Cath Maige Tuired 129</strong><cite>Stokes</cite></footer></blockquote>\n<p>This posture is known in the scholarship as <em>corrguinecht</em>, and is translated in the non-academic space as “crane pose”, drawing similarities between standing on one leg and a crane’s resting pose, drawn from the word <em>corr</em> “crane, heron”, and <em>guin</em> “wounding, harming”. See <a href=\"https://www.interesly.com/medieval-irish-cursing/\">this post</a> for this etymology. A more academic etymology uses the alternate meaning of <a href=\"https://dil.ie/12513\"><em>corr</em></a>, “point, peak, sharp object”, reminiscent of a crane’s beak but also of needles or weapons. The song itself is identified as <em>glám dícenn</em>, or “satire of two points”, which is also used by Coipre mac Etaín <a href=\"https://archive.org/details/revueceltique12pari/page/70/mode/2up\">earlier</a> in the story against Bres of the Fomorians. These two magical rituals, one of speech and the other of posture, are purportedly related here and elsewhere but seem not to be the same thing: they can be performed separately and serve separate functions. The stance then, I suspect, is an amplifier of the incantation, and the incantation is used to raise the spirits of the <em>Tuatha Dé</em>. The <em>glám dícenn</em> is typically used as a curse, in fact Coipre mac Etaín lists is <a href=\"https://archive.org/details/revueceltique12pari/page/90/mode/2up\">here in 115.</a> as a weapon to be used against the Fomorians, but Lugh uses it for the benefit of his own army thus implying that the ritual is neutral, and the speech itself makes it a blessing or a curse.</p>\n<p>Despite the better etymology for <em>corrguinecht</em> as “wounding with points”, we still must account for Lugh’s mysterious stance here, which I am inclined to believe still relates to the crane or heron and its role as a bird which traverses land, heaven, and sea (i.e. the underworld). A singer invoking the crane or contorting his spirit to become a crane-spirit during a ritual would thus be taking on this cosmological quality for the amplification of his magic.</p>\n<p>The <em>corrguinecht</em> and the <em>glám dícenn</em> will be treated in a later post.</p>\n<p><img src=\"/The-Song-of-Lugh/Crane.jpg\" alt=\"\"></p>\n<p>Fin.</p>\n<hr>\n<h2 id=\"Further-Reading\">Further Reading</h2>\n<p>On Medieval Manuscripts:</p>\n<p><a href=\"https://guides.loc.gov/manuscript-facsimiles/deciphering-scribal-abbreviations#s-lib-ctab-24229924-8\">Deciphering Scribal Abbreviations</a></p>\n<p><a href=\"https://sites.ualberta.ca/~sreimer/ms-course/course/punc.htm\">Manuscript Studies - Punctuation and Other Symbols</a></p>\n<p><a href=\"https://spotlight.vatlib.it/latin-paleography/feature/10-1-insular-majuscule-or-round-insular\">Insular Script</a></p>\n<p>On Old Irish:</p>\n<p><a href=\"https://archive.org/details/thurneysen-a-grammar-of-old-irish\">A Grammar of Old Irish</a> by Rudolf Thurneysen</p>\n<p><a href=\"https://archive.org/details/conciseoldirishg01pokouoft\">A Concise Old Irish Grammar and Reader</a> by Julius Pokorny</p>\n<p>On the <em>Cath Maige Tuired</em>:</p>\n<p><a href=\"https://people.umass.edu/sharris/in/handouts/Cath_Maige_Tuired.pdf\">Elizabeth Gray’s Translation</a></p>\n<p>On Irish Magic:</p>\n<p><a href=\"https://www.cambridge.org/core/books/celtic-curses/1C98E6A5F9E316AC729361BC9D245890\">Celtic Curses</a> by Bernard Mees</p>\n<p><a href=\"https://academic.oup.com/past/article/247/1/113/5721469\">Irish Cursing and the Art of Magic, 1750–2018</a> by Thomas Waters</p>\n",
            "tags": [
                "Magic",
                "Old Irish"
            ]
        },
        {
            "id": "https://uisneac.com/Nine-Herbs-Charm/",
            "url": "https://uisneac.com/Nine-Herbs-Charm/",
            "title": "Nine Herbs Charm",
            "date_published": "2024-07-19T01:27:00.000Z",
            "content_html": "<link rel=\"stylesheet\" class=\"aplayer-secondary-style-marker\" href=\"/assets/css/APlayer.min.css\"><script src=\"/assets/js/APlayer.min.js\" class=\"aplayer-secondary-script-marker\"></script><link rel=\"stylesheet\" type=\"text/css\" href=\"https://cdn.jsdelivr.net/hint.css/2.4.1/hint.min.css\"><p><img src=\"/Nine-Herbs-Charm/Anglo-SaxonWarrior.jpg\" alt=\"Anglo-Saxon Warrior\"></p>\n<p>My reading of the Anglo-Saxon Nine Herbs Charm or 𝘕𝘪𝘨𝘰𝘯 𝘞𝘺𝘳𝘵𝘢 𝘎𝘢𝘭𝘥𝘰𝘳, which is one of the few Anglo-Saxon magical and medical texts that survives. It brings Woden and Christ into the same text, among many other esoteric passages. The Nine Herbs Charm was translated by Oswald Cockayne in 1866, seen <a href=\"https://archive.org/details/leechdomswortcun03cock/page/30/mode/2up\">here</a>, and recently by Joseph Hopkins for <a href=\"http://mimmisbrunnr.info\">mimmisbrunnr.info</a> in 2020, seen <a href=\"https://www.mimisbrunnr.info/nigon-wyrta-galdor\">here</a>, and there are a few contentious points that people disagree on.</p>\n<h2 id=\"Herbs-and-Disease\">Herbs and Disease</h2>\n<p>Many of you will be interested in Woden, the glory-twigs, and the seven worlds, but this is foremost a medicinal text. The nine herbs are:</p>\n<p>𝘔𝘶𝘤𝘨𝘸𝘺𝘳𝘵 - Mugwort<br>\n𝘞𝘦𝘨𝘣𝘳𝘢𝘥𝘦 “Waybread” - Plantain<br>\n𝘚𝘵𝘶𝘯𝘦 - Lamb’s Cress<br>\n𝘈𝘵𝘵𝘰𝘳𝘭𝘢ð𝘦 - Fumitory<br>\n𝘔æ𝘨ðe - Chamomile<br>\n𝘞𝘦𝘳𝘨𝘶𝘭𝘶 - Nettle<br>\nÆ𝘱𝘱𝘦𝘭 - Crab Apple<br>\n𝘍𝘪𝘭𝘭𝘦 - Chervil<br>\n𝘍𝘪𝘯𝘶𝘭𝘦 - Fennel</p>\n<p>The text names the plant and sings the virtues of each, but the plant list is debated since the poem is unclear, some names may not be names. And in the prose section after the poem, the author changes the nine herbs: <em>stune</em> becomes lambscress, <em>wergulu</em> becomes nettle. But we know there are nine since in the prose he says there are 𝘯𝘺𝘨𝘰𝘯 𝘸𝘺𝘳𝘵𝘢, nine worts, which prevail against the nine venoms and nine “flying vile things”. The herbs are conceived of as nine types of soldier, warriors of the plant world, which war against poison, and which were placed in the world by the Lord (Christ or Woden). This warband of plants is led by the heavenly Lord.</p>\n<p>Poison and disease are thought of as invisible serpents that writhe across the land, or swarms of flies in the air. They are called “loathful ones”, 𝘸𝘺𝘳𝘮.</p>\n<blockquote><p>þu miht ƿiþ attre<br>\n⁊ ƿið onflyge<br>\nþu miht ƿiþ þa laþan<br>\nðe geond lond færð<br>\n <br>\nFor venom availest,<br>\nFor flying vile things;<br>\nMighty against loathed ones<br>\nThat through the land rove.</p>\n<footer><strong>Lines 9-12</strong><cite>Cockayne</cite></footer></blockquote>\n<p>Each herb has some inner strength that destroys or nullifies the venom of these malevolent spirits which wreak disease, if prepared the right way. Here it instructs the reciter to make a salve of the herbs, fennel, ashes, water, and egg, then to bathe the wound in it.</p>\n<blockquote><p>Mugwort, waybroad which spreadeth open towards the east, lambscress, attorlothe, maythen, nettle, crab apple, chervil, fennel, and old soap; work the worts to a dust, mingle with the soap and with the verjuice of the apple; form a slop of water and of ashes, take fennel, boil it in the slop, and foment with egg mixture, when the man puts on the salve, either before or after. Sing the charm upon each of the worts; thrice before “he” works them up, and over the apple in like manner; and sing into the mans mouth and into both his ears the same magic song, and into the wound, before he applies the salve.</p>\n<footer><strong>Paragraph 46</strong><cite>Cockayne</cite></footer></blockquote>\n<p>This is ancient herb-medicine. In Ireland at around this time (10th century), doctors had divided medicine into herb-medicine (pharmacology), knife-medicine (surgery), and song-medicine (prayer/chanting), which were the three methods available to ancient doctors: chemical intervention, surgical intervention, or lifestyle change. This entire charm is meant to be sung, hence why we call it the nine herbs 𝘨𝘢𝘭𝘥𝘰𝘳 or song. In fact, in the previous excerpt, we are specifically instructed to sing this charm to the herbs, and into the victim’s mouth and ears, and into the wound.</p>\n<p>Disease was seen as something which lingers high in the air, in cold, wet places, or within animals and plants which hate mankind, caused by malevolent spirits and which overtake people suddenly. A sickness must be weakened, then banished. Here, venom is something to be “blown away”.</p>\n<blockquote><p>Motan ealle weoda nu ƿyrtum aspringan<br>\nsæs toslupan, eal sealt ƿæter<br>\nðonne ic þis attor of ðe geblaƿe<br>\n <br>\nAll weeds now may Give way to worts.<br>\nSeas may dissolve, All salt water,<br>\nwhen I this venom from thee blow.</p>\n<footer><strong>Paragraph 45</strong><cite>Cockayne</cite></footer></blockquote>\n<p>The doctor is to blow the venom (or its evil spirit) out of the body, and then into something else, like the endless salty sea or a useless weed (𝘸𝘦𝘰𝘥𝘢) where it cannot do harm. It was the common view in most pre-modern societies that many things seen and unseen in the world were hostile to Man, and that an ally god would lead us in opposing these wild forces. For that reason he gave us the herbs, and taught us to use them. Chervil and Fennel, the author says, are mighty against pain, venom, a fiend’s hand, great guile, against small, bewitching wights.</p>\n<blockquote><p>earmum and eadigum<br>\neallum to bote<br>\nStond heo ƿið ƿærce,<br>\nstunað heo ƿið attre<br>\nseo mæg ƿið * III<br>\n⁊ wið XXX<br>\nƿið feondes hond<br>\nƿið frea begde<br>\nƿið malscrunge<br>\nminra wihta<br>\n <br>\nFor the poor and the rich,<br>\nPanacea for all.<br>\nIt standeth against pain<br>\nIt stoundeth at venom,<br>\nStrong it is gainst three<br>\nAnd against thirty;<br>\nGainst the hand of the fiend,<br>\n(To the Lord low it louted)<br>\nGainst foul fascination<br>\nOf farm stock of mine.</p>\n<footer><strong>Lines 74-86</strong><cite>Cockayne</cite></footer></blockquote>\n<p>Note: the word ‘wihta’ is here translated by Cockayne as ‘farm-stock’, but truly just means ‘<a href=\"https://en.wiktionary.org/wiki/wiht#Old_English\">thing, creature</a>’.</p>\n<p><img src=\"/Nine-Herbs-Charm/Demon.jpg\" alt=\"Saint John the Evangelist on Patmos by Master of the Rotterdam Saint John on Patmos\"></p>\n<figcaption>Saint John the Evangelist on Patmos, c. 1475</figcaption>\n<hr>\n<h2 id=\"Wuldortanas\"><em>Wuldortanas</em></h2>\n<blockquote><p>Ðas VIIII ongon<br>\nƿið nygon attrum.<br>\nⵜǷyrm com snican,<br>\ntoslat he nan<br>\nða genam Ƿoden<br>\n* VIIII * ƿuldortanas<br>\nsloh ða þa næddran<br>\nþæt heo on VIIII * tofleah<br>\n <br>\nThese nine can march on<br>\nGainst nine ugly poisons.<br>\nA worm sneaking came<br>\nTo slay and to slaughter;<br>\nThen took up Woden<br>\nNine wondrous twigs,<br>\nHe smote then the nadder<br>\nTill it flew in nine bits.</p>\n<footer><strong>Line 59-66</strong><cite>Cockayne</cite></footer></blockquote>\n<p>Woden is named as leading the attack against the hostile 𝘸𝘺𝘳𝘮, taking nine glory-twigs 𝘸𝘶𝘭𝘥𝘰𝘳𝘵𝘢𝘯𝘢𝘴 and killing the serpent with them, diving it into nine pieces, and letting the crabapple dilute its venom. These glory-twigs are completely unknown. They could be pieces of wood carved with runes or other magical symbols, which are not unknown in the Germanic and Indo-European world. Tacitus <a href=\"https://www.perseus.tufts.edu/hopper/text?doc=Perseus%3Atext%3A1999.02.0083%3Achapter%3D10\">says</a> that ancient Germans used boughs of a fruit tree, cut into pieces and carved with markings, which aid in divination:</p>\n<blockquote><p>The use of the lots is simple. A little bough is lopped off a fruit-bearing tree, and cut into small pieces; these are distinguished by certain marks, and thrown carelessly and at random over a white garment. In public questions the priest of the particular state, in private the father of the family, invokes the gods, and, with his eyes towards heaven, takes up each piece three times, and finds in them a meaning according to the mark previously impressed on them. If they prove unfavourable, there is no further consultation that day about the matter; if they sanction it, the confirmation of augury is still required.</p>\n<footer><strong>Germania</strong><cite>Chapter 10</cite></footer></blockquote>\n<p>The Canterbury Charm is a runic marginal note calling on Thor to eliminate disease.<sup id=\"fnref:1\"><a href=\"#fn:1\" rel=\"footnote\"><span class=\"hint--top hint--error hint--medium hint--rounded hint--bounce\" aria-label=\"See Cotton MS Caligula A XV in the British Library, folio [123v](https://iiif.bl.uk/uv/#?manifest=https://bl.digirati.io/iiif/ark:/81055/vdc_100058106204.0x000001) and [124r](https://iiif.bl.uk/uv/#?manifest=https://bl.digirati.io/iiif/ark:/81055/vdc_100058106204.0x000001).\n\">1</span></a></sup> The fact that the Canterbury Charm had to be written in the margins of an unrelated text implies that the very act of being written down or carved was an essential part of the power of runes—writing itself as invocation. Perhaps Woden used runes and magic to banish the malignant spirits.</p>\n<p><img src=\"/Nine-Herbs-Charm/CanterburyCharm.jpg\" alt=\"The Canterbury Charm and its Runes\"></p>\n<figcaption>The Canterbury Charm in Manuscript and Transcribed</figcaption>\n<blockquote><p>Gyril wound-causer, go now! You are found. May Thor bless you, lord of ogres! Gyril wound-causer. Against blood-vessel pus!</p>\n<footer><strong>The Canterbury Charm</strong><cite>Macleod and Mees</cite></footer></blockquote>\n<p>Furthermore, the origins of the Irish ogham script is in carvings onto wood. The <a href=\"https://archive.org/details/auraicept00calduoft/page/272/mode/2up\"><em>Auraicept na n-Eces</em></a> relates that the god Ogma created the alphabet by carving seven Bs into a strip of birch wood:</p>\n<blockquote><p>This moreover is the first thing that was written by Ogham, b was written, and to convey a warning to Lug son of Ethliu it was written respecting his wife lest she should be carried away from him into faeryland, to wit, seven b’s in one switch of birch</p>\n<footer><strong>Auraicept na n-Eces</strong><cite>Calder 1917</cite></footer></blockquote>\n<p>Or the nine 𝘸𝘶𝘭𝘥𝘦𝘳𝘵𝘢𝘯𝘢𝘴 could be the nine herbs themselves, which would fit with the repetition of the number nine in the preceding lines. Ultimately it will be impossible to know for sure, as with many ancient mysteries.</p>\n<p><img src=\"/Nine-Herbs-Charm/Tree.jpg\" alt=\"\"></p>\n<hr>\n<h2 id=\"Woden-⁊-Christ\">Woden ⁊ Christ</h2>\n<blockquote><p>ða genam Ƿoden * VIIII * ƿuldortanas<br>\nsloh ða þa næddran þæt heo on VIIII * tofleah<br>\nÞær geændade æppel and attor<br>\n…<br>\nⵜFille and finule, felamihtigu twa<br>\nþa ƿyrte gesceop ƿitig drihten<br>\nhalig on heofonum, þa he hongode<br>\nsette and sænde on VII ƿorulde<br>\nearmum and eadigum eallum to bote<br>\n…<br>\nⵜCrist stod ofer adle ængan cundes<br>\n <br>\nThen Wōden took VIIII glory-twigs,<br>\nstruck the serpent,<br>\nthat she into VIIII flew,<br>\n…<br>\nⵜFille and finule, a very mighty two,<br>\nthese worts the wise lord shaped,<br>\nholy in the heavens, while he hung,<br>\nset and sent them to VII worlds,<br>\npoor and prosperous, as remedy for all.<br>\n…<br>\nⵜChrist stood over sickness of every kind.</p>\n<footer><strong>Lines 63-65 and Paragraph 45</strong><cite>Hopkins</cite></footer></blockquote>\n<p>The mention of Woden and Christ together seems contradictory. Is this a Christian writing down an invocation to a pagan god? Naturally the impassable pagan/Christian divide is mostly a modern invention of neopagans and secularized Christians. Medieval people were not often so discriminatory, calling upon a spirit or God as needed. If Christ seemingly failed them, they might in desperation call upon Woden or Thunor, then revert to Christ, or call upon a countless number of local land spirits, <em>genii locorum</em>. The author seems to do just this, and even have fun with it, when he leaves ambiguity here. Which wise Lord (𝘸𝘪𝘵𝘪𝘨 𝘥𝘳𝘪𝘩𝘵𝘦𝘯) hangs in heaven, on a cross or on a tree? The same ambiguity is seen in the <a href=\"https://www.csun.edu/~sk36711/WWW/258/DreamofRood.pdf\">Dream of the Rood</a> which, for one example among many, calls the Cross a “Victory-beam” or “Victory-tree”. Both gods were meant to heal (or destroy evil spirits), and here we can see a melding of belief systems.</p>\n<p>But this isn’t a direct attestation of Anglo-Saxon paganism: it is simply a historical account of the ancient origin of the <em>wuldortanas</em>. Christians like Alfred the Great also preserved Woden in the historical account of his own genealogy,<sup id=\"fnref:2\"><a href=\"#fn:2\" rel=\"footnote\"><span class=\"hint--top hint--error hint--medium hint--rounded hint--bounce\" aria-label=\"See *Historia Brittonum* [here](https://www.gutenberg.org/files/1972/1972-h/1972-h.htm) for the genealogy of English kings c. 850 AD, or the *Anglian Collection of Royal Genealogies* [here](https://www.jstor.org/stable/44510666) c. 800 AD.\n\">2</span></a></sup> tracing his origin to a pre-Christian god but not worshipping that god (perhaps euhemerism was a popular belief).</p>\n<p><img src=\"/Nine-Herbs-Charm/Woden.jpg\" alt=\"Woden\"></p>\n<figcaption>Woden</figcaption>\n<hr>\n<h2 id=\"Nygon-Naedran\">Nygon Nædran</h2>\n<blockquote><p>Ic ana ƿat ea rinnende<br>\nþær þa nygon nædran behealdað<br>\n <br>\nI alone know water running<br>\nwhere the nine serpents beheld.</p>\n<footer><strong>Paragraph 45</strong><cite>Hopkins</cite></footer></blockquote>\n<p>These are the two most esoteric details, which I will struggle to treat somprehensively here. First, this verse that “I alone know a running stream, and the nine adders beware it”. The active verb here is 𝘣𝘦𝘩𝘦𝘢𝘭𝘥𝘢ð, “beholdeth”, but the meaning in Old English could be to hold, to behold, to do, to occupy. What is this running stream, and what are these nine serpents? The connection between serpents and running rivers is especially old, and could encompass a being like Niðhöggr, who in Völuspá and Gylfaginning is described in or near a river or the spring Hvergelmir:</p>\n<blockquote><p>En svá margir ormar eru í Hvergelmi með Níðhögg, at engi tunga má telja. Svá segir hér:<br>\n <br>\nAskr Yggdrasils<br>\ndrýgir erfiði<br>\nmeira en menn viti;<br>\nhjörtr bítr ofan,<br>\nen á hliðu fúnar,<br>\nskerðir Níðhöggr neðan.<br>\n <br>\nSvá er enn sagt:<br>\n <br>\nOrmar fleiri liggja<br>\nund aski Yggdrasils<br>\nen þat of hyggi hverr ósviðra apa.<br>\nGóinn ok Móinn,<br>\nþeir eru Grafvitnis synir,<br>\nGrábakr ok Grafvölluðr,<br>\nÓfnir ok Sváfnir,<br>\nhygg ek, at æ myni<br>\nmeiðs kvistum má.<br>\n <br>\nMoreover, so many serpents are in Hvergelmir with Nídhöggr, that no tongue can tell them, as is here said:<br>\n <br>\nAsh Yggdrasill | suffers anguish,<br>\nMore than men know of:<br>\nThe stag bites above; | on the side it rotteth,<br>\nAnd Nídhöggr gnaws from below.<br>\n <br>\nAnd it is further said:<br>\n <br>\nMore serpents lie | under Yggdrasill’s stock<br>\nThan every unwise ape can think:<br>\nGóinn and Móinn | (they’re Grafvitnir’s sons),<br>\nGrábakr and Grafvölludr;<br>\nÓfnir and Sváfnir | I think shall aye<br>\nTear the trunk’s twigs.</p>\n<footer><strong>Gylfaginning 16</strong><cite>Brodeur 1916</cite></footer></blockquote>\n<blockquote><p>Sá hon þar vaða<br>\nþunga strauma<br>\nmenn meinsvara<br>\nok morðvarga<br>\nok þann er annars glepr<br>\neyrarúnu;<br>\nþar saug Niðhöggr<br>\nnái framgengna,<br>\nsleit vargr vera.<br>\nVituð ér enn - eða hvat?<br>\n <br>\nI saw there wading | through rivers wild<br>\nTreacherous men | and murderers too,<br>\nAnd workers of ill | with the wives of men;<br>\nThere Nithhogg sucked | the blood of the slain,<br>\nAnd the wolf tore men; | would you know yet more?</p>\n<footer><strong>Völuspá 39</strong><cite>Bellows 1923</cite></footer></blockquote>\n<p>Possibly the verb 𝘣𝘦𝘩𝘦𝘢𝘭𝘥𝘢ð means that nine adders occupy the running river of Hell, and that this steaming river is where all disease originates. This would certainly be implied by the Völuspá and Gylfaginning passages. Likewise in Ireland, the famous Salmon of Wisdom which swim the Boyne and the Shannon are <a href=\"https://archive.org/details/toddlectureserie10royauoft/page/292/mode/2up\">local reflexes</a> of an earlier serpent-in-river myth; one theory, which I believe wholeheartedly, is that since Ireland has no natural snakes the salmon are a substitute of one scaly aquatic creature for another.</p>\n<blockquote><p>In úair is abaig in cúas<br>\ntuitit 'sin tiprait anúas:<br>\nthís immarlethat ar lár,<br>\nco nosethat na bratán.<br>\n <br>\nWhen the cluster of [hazel] nuts is ripe<br>\nthey fall down into the well:<br>\nthey scatter below on the bottom,<br>\nand the salmon eat them.</p>\n<footer><strong>Metrical Dinshendchas - Sinann II</strong><cite>Gwynn 1913</cite></footer></blockquote>\n<p>But if 𝘣𝘦𝘩𝘦𝘢𝘭𝘥𝘢ð instead meant that the serpents “behold” or “fear” the river, this also agrees with <a href=\"https://www.perseus.tufts.edu/hopper/text?doc=Perseus:text:1999.02.0137:book=29:chapter=12\">an account</a> from Pliny about a Gaulish druidic rite wherein a druid steals a serpent’s egg, then as the creatures chase him he flees over a river, whereat the serpents halt.</p>\n<blockquote><p>there is another kind of egg, held in high renown by the people of the Gallic provinces, but totally omitted by the Greek writers. In summer time, numberless snakes become artificially entwined together, and form rings around their bodies with the viscous slime which exudes from their mouths, and with the foam secreted by them: the name given to this substance is “anguinum.” The Druids tell us, that the serpents eject these eggs into the air by their hissing,4 and that a person must be ready to catch them in a cloak, so as not to let them touch the ground; they say also that he must instantly take to flight on horseback, as the serpents will be sure to pursue him, until some intervening river has placed a barrier between them.</p>\n<footer><strong>Pliny</strong><cite>Historia Naturalis 29.12</cite></footer></blockquote>\n<p>I’ve theorized on this passage <a href=\"https://x.com/ogmios/status/1377785701983477769\">before</a>, and since then have found a few other cognate myths. The simple meaning of the serpent’s fear of rivers, if the serpents represent disease, is an injunction to bathing in fresh water. The more hidden meaning may be one of attaining enlightenment. Recall how Asgard is supposedly separated from our world by a number of running rivers.<sup id=\"fnref:3\"><a href=\"#fn:3\" rel=\"footnote\"><span class=\"hint--top hint--error hint--medium hint--rounded hint--bounce\" aria-label=\"See *Gylfaginning* 15, [here](https://www.germanicmythology.com/ProseEdda/BRODEURPrologeandGylfaginning.html).\n\">3</span></a></sup> Recall also that Thor must wade through those rivers to get to the home of the gods, while the others choose to ride on a flaming rainbow bridge above him.<sup id=\"fnref:3\"><a href=\"#fn:3\" rel=\"footnote\"><span class=\"hint--top hint--error hint--medium hint--rounded hint--bounce\" aria-label=\"See *Gylfaginning* 15, [here](https://www.germanicmythology.com/ProseEdda/BRODEURPrologeandGylfaginning.html).\n\">3</span></a></sup> Perhaps this is Thor’s connection to humanity or his business killing devils which make him unclean, or perhaps he patrols the rivers for hidden dark spirits. Serpents are representative of bad spirits and sicknesses, which abhor fresh and clean running water, which can bite a sinner and either spread its own malignant essense into him, i.e. venom, or drink his blood thereby proving the sinner’s vile nature, i.e. a monster prefers blood like to itself. Thus passing over a river represents spiritual and corporeal purification, and the singer of this charm referencing a purifying river would indicate his own ritual purity, essential for healing.</p>\n<p>This may be part of a larger Indo-European ritual cosmology.</p>\n<p><img src=\"/Nine-Herbs-Charm/Salmon.jpeg\" alt=\"\"></p>\n<hr>\n<h2 id=\"Seofon-Worulde\">Seofon Worulde</h2>\n<blockquote><p>ⵜFille and finule, felamihtigu twa<br>\nþa ƿyrte gesceop ƿitig drihten<br>\nhalig on heofonum, þa he hongode<br>\nsette and sænde on VII ƿorulde<br>\nearmum and eadigum eallum to bote<br>\n <br>\nⵜFille and finule, a very mighty two,<br>\nthese worts the wise lord shaped,<br>\nholy in the heavens, while he hung,<br>\nset and sent them to VII worlds,<br>\npoor and prosperous, as remedy for all.</p>\n</blockquote>\n<p>The second esoteric passage in the Nine Herbs Charm is this one, not only for the Lord hanging in Heaven, but for the strange mention of “seven worlds” (𝘝𝘐𝘐 𝘸𝘰𝘳𝘶𝘭𝘥𝘦). Why not the typical nine worlds of the Eddas?</p>\n<p>Whenever seven worlds appear, you can be sure of ancient astrology. The seven worlds can be seen in the sky: the Sun, Moon, Mercury, Venus, Mars, Jupiter and Saturn. But then how can the Lord send Chervil and Fennel to those worlds? Who lives there? These seven worlds must then be places inhabited by creatures and accessible. Planets are not ruled out, but that concept would be foreign to the Anglo-Saxon mind. More likely these are separate regions of a larger cosmos, yet connected, much as the nine worlds of Yggdrasil are. Or they could be more abstract planes of being. In the Rig Veda there is an indication of both seven and nine worlds, but seven seems to prevail.<sup id=\"fnref:4\"><a href=\"#fn:4\" rel=\"footnote\"><span class=\"hint--top hint--error hint--medium hint--rounded hint--bounce\" aria-label=\"See *The Cosmology of the Rigveda* by H. W. Wallis pg. 114, [here](https://archive.org/details/thecosmologyofth00walluoft/page/114/mode/2up), which concludes a cosmology of nine worlds by the time of Atharvaveda. For an argument for seven worlds, see *Vishnu in Rigveda* by Dmitri Semenov, [here](https://www.academia.edu/33047934/Vishnu_in_Rigveda), for certain passages which support the primacy of seven worlds in Rigveda.\n\">4</span></a></sup> There is Earth and Heaven firstly, which are joined together “like two bowls turned toward each other”. Then there is the midspace between them, bringing us to 3 locations. Then we divide the Earth and Heaven each into three subsections, bringing us to 7 locations in the cosmos. Each location is then governed by a planet in the sky, which is a god or a god’s abode, or in some senses his vehicle, since the gods preside in starry Heaven, much like the many halls enumerated in the Edda which belong to one or another Norse god.</p>\n<p>But these realms are not locations, rather they are states of being which can be traversed by the ritual practitioner.<sup id=\"fnref:5\"><a href=\"#fn:5\" rel=\"footnote\"><span class=\"hint--top hint--error hint--medium hint--rounded hint--bounce\" aria-label=\"See *Vishnu in Rigveda* by Semenov, [here](https://www.academia.edu/33047934/Vishnu_in_Rigveda).\">5</span></a></sup> How many times in the Rig Veda does the singer desire to attain Heaven, lifted up by Agni to the home of the gods? Too many to count. He achieves this through his ritual alteration of consciousness. This reference in the Nine Herbs Charm may be a distant echo of such a cosmology, with the healer who sings this chant altering his state of consciousness to better interact with the malignant spirits.</p>\n<p>Some also have taken the word 𝘸𝘰𝘳𝘶𝘭𝘥𝘦 to mean “age of man” or “aion” instead or “world”, denoting time, not place. This would reduce the cosmology, but creates problems in parsing the logic of the verse then. Nevertheless, this has been the Nine Herbs Charm.</p>\n<p>I will finish this article for now. This impressive example of ancient medicine splendidly treats the nine herbs as beings, warriors even, in a spiritual battle against plague wights which stalk the lands unfit for habitation, revealing an ancient animist perspective in addition to its Christian and Germanic pagan ones.</p>\n<p><img src=\"/Nine-Herbs-Charm/Druid.jpg\" alt=\"Druid with Herbs\"></p>\n<figcaption>The Chief Druid by Thomas Pennant, 1781</figcaption>\n<p>Fin</p>\n<div id=\"footnotes\"><hr><div id=\"footnotelist\"><ol style=\"list-style: none; padding-left: 0; margin-left: 40px\"><li id=\"fn:1\"><span style=\"display: inline-block; vertical-align: top; padding-right: 10px; margin-left: -40px\">1.</span><span style=\"display: inline-block; vertical-align: top; margin-left: 10px;\">See Cotton MS Caligula A XV in the British Library, folio <a href=\"https://iiif.bl.uk/uv/#?manifest=https://bl.digirati.io/iiif/ark:/81055/vdc_100058106204.0x000001\">123v</a> and <a href=\"https://iiif.bl.uk/uv/#?manifest=https://bl.digirati.io/iiif/ark:/81055/vdc_100058106204.0x000001\">124r</a>.<a href=\"#fnref:1\" rev=\"footnote\">↩</a></span></li><li id=\"fn:2\"><span style=\"display: inline-block; vertical-align: top; padding-right: 10px; margin-left: -40px\">2.</span><span style=\"display: inline-block; vertical-align: top; margin-left: 10px;\">See <em>Historia Brittonum</em> <a href=\"https://www.gutenberg.org/files/1972/1972-h/1972-h.htm\">here</a> for the genealogy of English kings c. 850 AD, or the <em>Anglian Collection of Royal Genealogies</em> <a href=\"https://www.jstor.org/stable/44510666\">here</a> c. 800 AD.<a href=\"#fnref:2\" rev=\"footnote\">↩</a></span></li><li id=\"fn:3\"><span style=\"display: inline-block; vertical-align: top; padding-right: 10px; margin-left: -40px\">3.</span><span style=\"display: inline-block; vertical-align: top; margin-left: 10px;\">See <em>Gylfaginning</em> 15, <a href=\"https://www.germanicmythology.com/ProseEdda/BRODEURPrologeandGylfaginning.html\">here</a>.<a href=\"#fnref:3\" rev=\"footnote\">↩</a></span></li><li id=\"fn:4\"><span style=\"display: inline-block; vertical-align: top; padding-right: 10px; margin-left: -40px\">4.</span><span style=\"display: inline-block; vertical-align: top; margin-left: 10px;\">See <em>The Cosmology of the Rigveda</em> by H. W. Wallis pg. 114, <a href=\"https://archive.org/details/thecosmologyofth00walluoft/page/114/mode/2up\">here</a>, which concludes a cosmology of nine worlds by the time of Atharvaveda. For an argument for seven worlds, see <em>Vishnu in Rigveda</em> by Dmitri Semenov, <a href=\"https://www.academia.edu/33047934/Vishnu_in_Rigveda\">here</a>, for certain passages which support the primacy of seven worlds in Rigveda.<a href=\"#fnref:4\" rev=\"footnote\">↩</a></span></li><li id=\"fn:5\"><span style=\"display: inline-block; vertical-align: top; padding-right: 10px; margin-left: -40px\">5.</span><span style=\"display: inline-block; vertical-align: top; margin-left: 10px;\">See <em>Vishnu in Rigveda</em> by Semenov, <a href=\"https://www.academia.edu/33047934/Vishnu_in_Rigveda\">here</a>.<a href=\"#fnref:5\" rev=\"footnote\">↩</a></span></li></ol></div></div>",
            "tags": [
                "Religion",
                "Anglo-Saxon",
                "Magic"
            ]
        }
    ]
}