{
    "version": "https://jsonfeed.org/version/1",
    "title": "Uisneaċ • All posts by \"greek\" tag",
    "description": "From ancient times until the fall of the Gaelic Order, a sacred fire at Uisneaċ was lit on Beltaine each year to initiate the Mórdáil Uisneaċ, the Great Assembly. As such Uisneaċ became spiritually the Umbilicas Hibernicae, the Navel of Ireland. It was a ceremonial gathering place for kings, possibly where the High King would symbolically marry the goddess Ériu in the banais ríghe ritual, or Marriage of the King. A fire was kept there perpetually into the Christian Age, kept alight by woman-druids in a similar fashion to Rome’s sacred flame tended by Vestal Virgins.",
    "home_page_url": "https://uisneac.com",
    "items": [
        {
            "id": "https://uisneac.com/Milk-in-the-Orphic-Grave-Tablets/",
            "url": "https://uisneac.com/Milk-in-the-Orphic-Grave-Tablets/",
            "title": "Milk in the Orphic Grave Tablets",
            "date_published": "2024-05-18T09:47:00.000Z",
            "content_html": "<link rel=\"stylesheet\" class=\"aplayer-secondary-style-marker\" href=\"/assets/css/APlayer.min.css\"><script src=\"/assets/js/APlayer.min.js\" class=\"aplayer-secondary-script-marker\"></script><p><img src=\"/Milk-in-the-Orphic-Grave-Tablets/Milk-2.jpg\" alt=\"An Icelandic Landscape - Milk Flowing in Ginnungagap\"></p>\n<p>A post on the appearance of milk in the Orphic Grave Tablets.</p>\n<p>Milk is used as a symbol of immortality, which an Orphic initiate attains after death through specific ritual. Numerous grave tablets have this analogy. Firstly, the Orphic grave tablets are a series of Greek inscriptions on gold tablets deposited in tombs, most often in Magna Grecia (South Italy). The greatest is the Petelia Tablet, seen here, which was rolled up inside a gold cylinder on a chain. Tablet is c. 300 BC, while the case is c. 100 AD.</p>\n<p><img src=\"/Milk-in-the-Orphic-Grave-Tablets/Petelia-Tablet.jpg\" alt=\"The Petelia Tablet\"></p>\n<p>Here you can see its Greek and next to it my translation. This is a rare tablet that does <em>not</em> mention milk, but which is the most famous and goes to show the kind of content we’re considering. After death the initiate is to find the Lake of Mnemosyne (Memory) and drink from it.</p>\n<table class=\"bilingual-table\" style=\"color:rgb(201, 202, 204);\"><thead><tr><th> Ancient Greek </th><th> English </th></tr></thead><tbody><tr><td> Εὑρήσσειϛ δ’ Ἀίδαο δόμων ἐπ ἀριστερὰ κρήνην, </td><td> You will find to the left of Hades' halls a spring, </td></tr><tr><td> πὰρ δ’ αὐτῆι λευκὴν ἑστηκυῖαν κυπάρισσον· </td><td> And beside it a shining cypress standing. </td></tr><tr><td> ταύτηϛ τῆϛ κρήνηϛ μηδὲ σχεδὸν ἐμπελάσειαϛ. </td><td> You will not come near to this spring. </td></tr><tr><td> εὑρήσειϛ δ’ ἑτέραν, τῆϛ Μνημοσύνηϛ ἀπὸ λίμνηϛ </td><td> You will find another, from the Lake of Memory, </td></tr><tr><td> ψυχρὸν ὕδωρ προρέον· φύλακεϛ δ’ ἐπίπροσθεν ἔασιν. </td><td> cold water flowing. Guards are stationed before it. </td></tr><tr><td> εἰπεῖν· Γῆϛ παῖϛ εἰμι καὶ Οὐρανοῦ ἀστερόεντοϛ, </td><td> Say: \"I am a child of Earth and starry Heaven, </td></tr><tr><td> αὐτὰρ ἐμοὶ γένοϛ οὐράνιον· τόδε δ’ ἴστε καὶ αὐτοί. </td><td> and my race is of heaven. You yourselves know this. </td></tr><tr><td> δίψηι δ’ εἰμὶ αὔη καὶ ἀπόλλυμαι. ἀλλὰ δότ’ αἶψα </td><td> I am parched to thirst and dying. Give me, quickly, </td></tr><tr><td> ψυχρὸν ὕδωρ προρέον τῆϛ Μνημοσύνηϛ ἀπὸ λίμνηϛ.’ </td><td> the cold water flowing from the Lake of Memory.\" </td></tr><tr><td> καὐτοί σοι δώσουσι πιεῖν θείηϛ ἀπὸ κρήνηϛ, </td><td> And they will give you to drink of the divine spring, </td></tr><tr><td> καὶ τότ ἔπειτα τέλη σὺ μεθ’ ἡρώεσσιν ἀνάξειϛ. </td><td> and then afterwards among the heroes you will have lordship. </td></tr><tr><td> Μνημοσύνης τόδε ... ... ... θανεῖσθαι ... </td><td> ... of Memory ... ... ... to die ...  </td></tr><tr><td> ... τόδε γραψ ... ... τογλωσειπα σκότοϛ ἀμφικαλύψαϛ. </td><td> ... that is written ... ... darkness envelopes. </td></tr></tbody></table>\n<p>After this the initiate will join the immortal heroes. Here is another one and my translation. This is a composition of the three Thurii Tablets A1-3 with almost identical texts; I have combined them in a way that seems most appropriate to me.</p>\n<p><img src=\"/Milk-in-the-Orphic-Grave-Tablets/Thurii-Tablet.jpg\" alt=\"A Thurii Tablet\"></p>\n<table class=\"bilingual-table\" style=\"color:rgb(201, 202, 204);\"><thead><tr><th> Ancient Greek </th><th> English </th></tr></thead><tbody><tr><td> Ἔρχομαι ἐκ καθαρῶν καθαρά, χθονίων βασίλεια, </td><td> I come pure from the pure, Queen of the Underworld, </td></tr><tr><td> Εὖκλε καὶ Εὐβουλεῦ τε καὶ θεοὶ ευδαίμονες ἄλλοι· </td><td> Eukles, Euboleus, gods and other good spirits, </td></tr><tr><td> καὶ γὰρ ἐγὼν ὑμῶν γένος εὔχομαι ὄλβιον εἶναι </td><td> for indeed of your blessed race I claim to be. </td></tr><tr><td> ποινὰν δ’ ἀνταπέτεισ’ αντ ἔργων οὔτι δικαίων. </td><td> You have repaid unrighteous deeds with punishments. </td></tr><tr><td> εἴτε με Μοῖρα ἐδάμασσε καὶ αθανατοι θεοι αλλοι </td><td> either Fate subdued me, or the other deathless gods, or the Thunderer throwing his thunderbolt. </td></tr><tr><td> βροντε τ’ ἀστεροπε τε και αιθαλοεντι κεραυνῶ. </td><td> I flew out of the bitter grief-stricken circle, </td></tr><tr><td> Κύκλου δ’ εξεπταν βαρυπενθοες αργαλεοιο </td><td> to the desired crown I came with swift feet, </td></tr><tr><td> ’Ιμερτόν δ’ επεβαν στεφανον ποσι καρπαλιμοισι </td><td> I went down under the bosom of the Lady, </td></tr><tr><td> Δεσποινας δ’ ύπο κολπον εδυν χθονιας βασιλειασ. </td><td> Queen of the Underworld. </td></tr><tr><td> Νυν δ’ ικετης αγνην ηκω παρα Φερσεφονειαν </td><td> Now a supplicant I have come beside pure Persephone </td></tr><tr><td> ’Ως με προφρων πεμψη εδρας ες τας μακαριστας εὐαγέων </td><td> so that, in kindness, she will send me to the seats of the most blessed pious ones. </td></tr><tr><td> ’Ολβιε και μακαριστε, θεος δέση άντι </td><td> Happy and most blessed, a god you shall be instead of a mortal. </td></tr><tr><td> βροτοιο εριφοσ ες γαλ’ επετον. </td><td> A kid goat flying into milk. </td></tr></tbody></table> \n<p>Notice the last line, “a kid (goat) flying/rushing into milk,” immediately after becoming a Θεός. An allegory for apotheosis, in which the young goat is submerged in that which he craves most, in the same way the initiate entering the halls of the heroes is plunged into bliss.</p>\n<p>Here is my translation of a third tablet from Thurii, Italy, known as A4. We once again see the formulation of a kid goat falling or rushing into milk immediately after the initiate has become a god, Θεός.</p>\n<table class=\"bilingual-table\" style=\"color:rgb(201, 202, 204);\"><thead><tr><th> Ancient Greek </th><th> English </th></tr></thead><tbody><tr><td> Ἀλλ’ ὁπόταν ψυχὴ προλίπηι φάος ἀελίοιο, </td><td> Whenever the soul might leave behind the light of the Sun, </td></tr><tr><td> δεξιὸν εννοιας δει τινα πεφυλαγμένον εὖ μάλα πάντα· </td><td> travel to the right, being well guarded in every way. </td></tr><tr><td> χαῖρε παθὼν τὸ πάθημα τὸδ’ οὔπω πρόσθε ἐπεπόνθεις· </td><td> Hail, you who has experienced this experience, which you had not experienced before. </td></tr><tr><td> θεὸς ει ελεεινού έξ άνθρόπου. ἔριφος ἐς γάλα ἔπετες. </td><td> A god has been gained from a man. A young goat falling into milk. </td></tr><tr><td> χαῖρε χαῖρε· δεξιὰν ὁδοιπορών </td><td> Hail, hail. Journey to the right through </td></tr><tr><td> λειμῶνάς τε ἱεροὺς κατ’ ἄλσεα Φερσεφονείας. </td><td> the holy meadows and groves of Persephone. </td></tr></tbody></table>\n<p>And a fourth from Pelinna, Thessaly, Greece. Here you see it most strongly, because it’s repeated three times (almost as if reflecting the thrice-blessed τρισολβιε appellation).</p>\n<table class=\"bilingual-table\" style=\"color:rgb(201, 202, 204);\"><thead><tr><th> Ancient Greek </th><th> English </th></tr></thead><tbody><tr><td> νῦν ἔθανες καὶ νῦν ἐγένου, τρισόλβιε, ἄματι τῶιδε. </td><td> Now you have died and you have been born, thrice-blessed, on this very day. </td></tr><tr><td> εἰπεῖν Φερσεφόναι σ’ ὅτι Βάκχιος αὐτὸς ἔλυσε. </td><td> Tell Persephone that Bacchus himself freed you. </td></tr><tr><td> ταιῦρος εἰς γάλα ἔθορες. </td><td> A bull into milk, you leapt. </td></tr><tr><td> αἶψα εἰς γάλα ἔθορες. </td><td> Quickly into milk, you sprang. </td></tr><tr><td> κριὸς εἰς γάλα ἔπεσες. </td><td> A ram into milk, you fell. </td></tr><tr><td> οἶνον ἔχεις εὐδαίμονα τιμὴν </td><td> You have wine as a fortunate honor </td></tr><tr><td> καὶ σὺ μὲν εἶς ὑπὸ γῆν τελέσας ἅπερ ὄλβιοι ἄλλοι </td><td> and you, indeed, will go under the earth, having been consecrated </td></tr><tr><td>  </td><td> as the other blessed ones. </td></tr></tbody></table>\n<p>So why milk? The simplest anthropological reading is that milk is something a kid (goat) craves, so falling into (an ocean of) milk represents the good afterlife, one where all the things which we sought in the  material world are supplied in abundance. This imagery would make sense to a pastoral people. This summing up all of Orphic initiation into a single symbolic phrase is called a <em>synthema</em>, and would serve to remind the initiate that all his trainings are what earn him immortality or knowledge of his true self. But the verb “rushing or leaping” (<em>εθορες</em>, <em>επεσες</em>) could also imply a ritualistic action or dance performed before death. We see this in other Greek cults, as when Cretan youths imitated the dance of the <em>Kouretes</em>, or when “rushing” Maenads celebrate the coming of Dionysus.</p>\n<p><img src=\"/Milk-in-the-Orphic-Grave-Tablets/Taurus-Leap.jpg\" alt=\"Cretan Athletes Leaping Over a Bull\"></p>\n<p>Milk in Greece, as in all Aryan societies, was connected intimately with the stars and therefore Heaven &amp; the gods. The word for milk, <em>γάλα</em> “gala”, seemed to converge with celestial words, like the Milky Way galaxy, known as <em>γάλακτος</em> <em>κύκλος</em> “milky wheel”, <em>γαλαχιος</em> “galaxios”, or even <em>το γάλα</em> “the milk”. The Milky Way was the Road of Souls to the afterlife, possibly what Pindar called “Zeus’s Way” in Olympian 2. Souls would also descend from the abode of the blessed gods to incarnate, thus explaining why babies needed to drink specifically milk from their mothers. There were many beliefs that souls became stars once in Heaven, as in this Arkesine inscription “Mother, do not weep for me. What is the use? You ought rather to reverence me, for I have become an evening star, among the gods.” So then our milk seems to be a stand-in for Heaven, or that the Heavens were observably full of milk. And when the tablets say <em>εις γάλα εθορες</em>, it may not mean “you rushed into milk”, but “you rushed into the galaxy (i.e. Heaven &amp; the gods)”.</p>\n<p>Milk was symbolic of the end of life for blessed heroes and initiates, and of the beginning of life for newborn babies. Thus it probably represented a cycle of rebirth, or at least incarnation. The wicked are deprived of milk in Hades or Tartaros. Is this idea Indo-European? We see an identical conflation in Ireland, where the Irish name of the Milky Way is the <em>Bealach ná Bó Finne</em> or “Way of the White Cow”; Vedic Aryans called it, among other names, <em>devapatha</em> or “god path”. In each, the souls of dead heroes walk it. The primordial milk-giving cow in <em>Gylfaginning</em> supports the life of Ymir, and perhaps the Norse thought it was her milk which spilled across Heaven to form the Milky Way. In Irish we seem to have a heavenly cow as well in the <em>Bó Firinne</em>.</p>\n<p>The connection between milk and the white galaxy overhead is strong, as is the conception of that region of the sky being the home of the gods. These are the double-meanings which Greek Orphic initiates understood when going through their trainings. For the initiate, his recollection of his “true self” would earn him entry into the abode of the gods and heroes, and so would literally enter the milk above, and fall into a milk which is desirable and pleasant. Since his enlightened state is due to his initiation, we could even say that his initiation on Earth is an early development of his enlightened state in Heaven, and so his initiation is the milk he seeks. And the initiate would be the young goat, inexperienced and even clumsy, who needs spiritual sustenance (i.e. Orphic wisdom).</p>\n<p>So, the milk formulae in these tablets appear to be synthemata meant to remind the initiate of the culmination of his Orphic training, and simultaneously of the immense pleasures of Heaven and the gods after death, just as we take pleasure from drinking fresh milk on Earth.</p>\n<p>That’s my broad, surface level theory, anyway.</p>\n<p>Fin.</p>\n",
            "tags": [
                "Religion",
                "Orphism",
                "Greek"
            ]
        }
    ]
}